[Killed] ArithmeticOperator
src/core/utils/async.ts:42:17
     timeout = 30000,
     cwd = process.cwd(),
     env = process.env,
-    maxBuffer = 10 * 1024 * 1024, // 10MB
+    maxBuffer = 10 * 1024 / 1024, // 10MB
     encoding = 'utf8',
   } = options;
killedBy: Async Utilities execCommand should execute simple commands
statusReason: expected 'hello worl' to be 'hello world' // Object.is equality

[Killed] ArithmeticOperator
src/core/utils/async.ts:42:17
     timeout = 30000,
     cwd = process.cwd(),
     env = process.env,
-    maxBuffer = 10 * 1024 * 1024, // 10MB
+    maxBuffer = 10 / 1024 * 1024, // 10MB
     encoding = 'utf8',
   } = options;
killedBy: Async Utilities execCommand should execute simple commands
statusReason: expected 'hello worl' to be 'hello world' // Object.is equality

[Killed] MethodExpression
src/core/utils/async.ts:56:15
     });
 
     return {
-      stdout: stdout.trim(),
+      stdout: stdout,
       stderr: stderr.trim(),
       code: 0,
killedBy: Async Utilities execCommand should execute simple commands
statusReason: expected 'hello world\n' to be 'hello world' // Object.is equality

[Survived] MethodExpression
src/core/utils/async.ts:57:15
 
     return {
       stdout: stdout.trim(),
-      stderr: stderr.trim(),
+      stderr: stderr,
       code: 0,
     };

[Survived] MethodExpression
src/core/utils/async.ts:68:15
       code?: number;
     };
     return {
-      stdout: execError.stdout?.trim() ?? '',
+      stdout: execError.stdout ?? '',
       stderr: execError.stderr?.trim() ?? execError.message,
       code: execError.code ?? 1,

[Survived] MethodExpression
src/core/utils/async.ts:69:15
     };
     return {
       stdout: execError.stdout?.trim() ?? '',
-      stderr: execError.stderr?.trim() ?? execError.message,
+      stderr: execError.stderr ?? execError.message,
       code: execError.code ?? 1,
     };

[Killed] BooleanLiteral
src/core/utils/async.ts:93:14
     const child = spawn(command, args, {
       cwd,
       env,
-      shell: false, // Disable shell to prevent injection
+      shell: true, // Disable shell to prevent injection
     });
 
killedBy: Async Utilities execCommandSafe should prevent shell injection
statusReason: expected 'nazq' to be '$(whoami)' // Object.is equality

[Killed] BooleanLiteral
src/core/utils/async.ts:98:20
 
     let stdout = '';
     let stderr = '';
-    let timedOut = false;
+    let timedOut = true;
 
     // Set up timeout
killedBy: Async Utilities execCommandSafe should execute commands with arguments safely
statusReason: Command timed out after 30000ms

[Killed] BlockStatement
src/core/utils/async.ts:102:26
 
     // Set up timeout
     const timeoutId = timeout
-      ? setTimeout(() => {
-          timedOut = true;
-          child.kill('SIGTERM');
-          setTimeout(() => {
-            if (!child.killed) {
-              child.kill('SIGKILL');
-            }
-          }, 5000);
-        }, timeout)
+      ? setTimeout(() => {}, timeout)
       : null;
 
killedBy: Async Utilities execCommandSafe should respect timeout
statusReason: promise resolved "{ stdout: '', stderr: '', code: +0 }" instead of rejecting

[Killed] BooleanLiteral
src/core/utils/async.ts:103:22
     // Set up timeout
     const timeoutId = timeout
       ? setTimeout(() => {
-          timedOut = true;
+          timedOut = false;
           child.kill('SIGTERM');
           setTimeout(() => {
killedBy: Async Utilities execCommandSafe should respect timeout
statusReason: promise resolved "{ stdout: '', stderr: '', code: +0 }" instead of rejecting

[NoCoverage] BlockStatement
src/core/utils/async.ts:105:28
       ? setTimeout(() => {
           timedOut = true;
           child.kill('SIGTERM');
-          setTimeout(() => {
-            if (!child.killed) {
-              child.kill('SIGKILL');
-            }
-          }, 5000);
+          setTimeout(() => {}, 5000);
         }, timeout)
       : null;

[NoCoverage] ConditionalExpression
src/core/utils/async.ts:106:17
           timedOut = true;
           child.kill('SIGTERM');
           setTimeout(() => {
-            if (!child.killed) {
+            if (false) {
               child.kill('SIGKILL');
             }

[NoCoverage] BlockStatement
src/core/utils/async.ts:106:32
           timedOut = true;
           child.kill('SIGTERM');
           setTimeout(() => {
-            if (!child.killed) {
-              child.kill('SIGKILL');
-            }
+            if (!child.killed) {}
           }, 5000);
         }, timeout)

[Killed] BlockStatement
src/core/utils/async.ts:114:47
       : null;
 
     // Collect stdout
-    child.stdout.on('data', (data: Buffer) => {
-      stdout += data.toString(encoding);
-    });
+    child.stdout.on('data', (data: Buffer) => {});
 
     // Collect stderr
killedBy: Async Utilities execCommandSafe should execute commands with arguments safely
statusReason: expected '' to be 'hello world' // Object.is equality

[NoCoverage] BlockStatement
src/core/utils/async.ts:119:47
     });
 
     // Collect stderr
-    child.stderr.on('data', (data: Buffer) => {
-      stderr += data.toString(encoding);
-    });
+    child.stderr.on('data', (data: Buffer) => {});
 
     // Handle process exit

[Survived] StringLiteral
src/core/utils/async.ts:119:21
     });
 
     // Collect stderr
-    child.stderr.on('data', (data: Buffer) => {
+    child.stderr.on("", (data: Buffer) => {
       stderr += data.toString(encoding);
     });

[Killed] BlockStatement
src/core/utils/async.ts:124:33
     });
 
     // Handle process exit
-    child.on('close', (code) => {
-      if (timeoutId) clearTimeout(timeoutId);
-
-      if (timedOut) {
-        reject(new Error(`Command timed out after ${timeout}ms`));
-      } else {
-        resolve({
-          stdout: stdout.trim(),
-          stderr: stderr.trim(),
-          code: code ?? 0,
-        });
-      }
-    });
+    child.on('close', (code) => {});
 
     // Handle errors
killedBy: Async Utilities execCommandSafe should execute commands with arguments safely
statusReason: Test timed out in 20000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/core/utils/async.ts:127:11
     child.on('close', (code) => {
       if (timeoutId) clearTimeout(timeoutId);
 
-      if (timedOut) {
+      if (false) {
         reject(new Error(`Command timed out after ${timeout}ms`));
       } else {
killedBy: Async Utilities execCommandSafe should respect timeout
statusReason: promise resolved "{ stdout: '', stderr: '', code: +0 }" instead of rejecting

[Killed] ConditionalExpression
src/core/utils/async.ts:127:11
     child.on('close', (code) => {
       if (timeoutId) clearTimeout(timeoutId);
 
-      if (timedOut) {
+      if (true) {
         reject(new Error(`Command timed out after ${timeout}ms`));
       } else {
killedBy: Async Utilities execCommandSafe should execute commands with arguments safely
statusReason: Command timed out after 30000ms

[Killed] BlockStatement
src/core/utils/async.ts:129:14
 
       if (timedOut) {
         reject(new Error(`Command timed out after ${timeout}ms`));
-      } else {
-        resolve({
-          stdout: stdout.trim(),
-          stderr: stderr.trim(),
-          code: code ?? 0,
-        });
-      }
+      } else {}
     });
 
killedBy: Async Utilities execCommandSafe should execute commands with arguments safely
statusReason: Test timed out in 20000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
src/core/utils/async.ts:131:19
         reject(new Error(`Command timed out after ${timeout}ms`));
       } else {
         resolve({
-          stdout: stdout.trim(),
+          stdout: stdout,
           stderr: stderr.trim(),
           code: code ?? 0,
killedBy: Async Utilities execCommandSafe should execute commands with arguments safely
statusReason: expected 'hello world\n' to be 'hello world' // Object.is equality

[Survived] LogicalOperator
src/core/utils/async.ts:133:17
         resolve({
           stdout: stdout.trim(),
           stderr: stderr.trim(),
-          code: code ?? 0,
+          code: code && 0,
         });
       }

[Killed] BlockStatement
src/core/utils/async.ts:139:34
     });
 
     // Handle errors
-    child.on('error', (error) => {
-      if (timeoutId) clearTimeout(timeoutId);
-      reject(error);
-    });
+    child.on('error', (error) => {});
   });
 }
killedBy: Async Utilities execCommandSafe should handle command not found
statusReason: promise resolved "{ stdout: '', stderr: '', code: -2 }" instead of rejecting

[Killed] StringLiteral
src/core/utils/async.ts:139:14
     });
 
     // Handle errors
-    child.on('error', (error) => {
+    child.on("", (error) => {
       if (timeoutId) clearTimeout(timeoutId);
       reject(error);
killedBy: Async Utilities execCommandSafe should handle command not found
statusReason: Test timed out in 20000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/core/utils/async.ts:158:60
   timeoutMs: number,
   timeoutError?: string,
 ): Promise<T> {
-  const timeoutPromise = new Promise<never>((_, reject) => {
-    setTimeout(() => {
-      reject(new Error(timeoutError ?? `Operation timed out after ${timeoutMs}ms`));
-    }, timeoutMs);
-  });
+  const timeoutPromise = new Promise<never>((_, reject) => {});
 
   return Promise.race([fn(), timeoutPromise]);
killedBy: Async Utilities withTimeout should timeout slow operations
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/core/utils/async.ts:159:22
   timeoutError?: string,
 ): Promise<T> {
   const timeoutPromise = new Promise<never>((_, reject) => {
-    setTimeout(() => {
-      reject(new Error(timeoutError ?? `Operation timed out after ${timeoutMs}ms`));
-    }, timeoutMs);
+    setTimeout(() => {}, timeoutMs);
   });
 
killedBy: Async Utilities withTimeout should timeout slow operations
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/core/utils/async.ts:160:24
 ): Promise<T> {
   const timeoutPromise = new Promise<never>((_, reject) => {
     setTimeout(() => {
-      reject(new Error(timeoutError ?? `Operation timed out after ${timeoutMs}ms`));
+      reject(new Error(timeoutError && `Operation timed out after ${timeoutMs}ms`));
     }, timeoutMs);
   });
killedBy: Async Utilities withTimeout should timeout slow operations
statusReason: expected [Function] to throw error including 'Operation timed out' but got ''

[Killed] StringLiteral
src/core/utils/async.ts:160:40
 ): Promise<T> {
   const timeoutPromise = new Promise<never>((_, reject) => {
     setTimeout(() => {
-      reject(new Error(timeoutError ?? `Operation timed out after ${timeoutMs}ms`));
+      reject(new Error(timeoutError ?? ``));
     }, timeoutMs);
   });
killedBy: Async Utilities withTimeout should timeout slow operations
statusReason: expected [Function] to throw error including 'Operation timed out' but got ''

[Killed] BlockStatement
src/core/utils/async.ts:204:41
   let lastError: Error;
   let delay = initialDelay;
 
-  for (let i = 0; i <= maxRetries; i++) {
-    try {
-      return await fn();
-    } catch (error) {
-      lastError = error instanceof Error ? error : new Error(String(error));
-
-      if (i < maxRetries) {
-        await new Promise((resolve) => setTimeout(resolve, delay));
-        delay *= 2; // Exponential backoff
-      }
-    }
-  }
+  for (let i = 0; i <= maxRetries; i++) {}
 
   throw lastError!;
killedBy: Async Utilities retryWithBackoff should succeed on first try
statusReason: undefined

[Killed] EqualityOperator
src/core/utils/async.ts:204:19
   let lastError: Error;
   let delay = initialDelay;
 
-  for (let i = 0; i <= maxRetries; i++) {
+  for (let i = 0; i > maxRetries; i++) {
     try {
       return await fn();
killedBy: Async Utilities retryWithBackoff should succeed on first try
statusReason: undefined

[Killed] BlockStatement
src/core/utils/async.ts:205:9
   let delay = initialDelay;
 
   for (let i = 0; i <= maxRetries; i++) {
-    try {
-      return await fn();
-    } catch (error) {
+    try {} catch (error) {
       lastError = error instanceof Error ? error : new Error(String(error));
 
killedBy: Async Utilities retryWithBackoff should succeed on first try
statusReason: undefined

[Killed] BlockStatement
src/core/utils/async.ts:207:21
   for (let i = 0; i <= maxRetries; i++) {
     try {
       return await fn();
-    } catch (error) {
-      lastError = error instanceof Error ? error : new Error(String(error));
-
-      if (i < maxRetries) {
-        await new Promise((resolve) => setTimeout(resolve, delay));
-        delay *= 2; // Exponential backoff
-      }
-    }
+    } catch (error) {}
   }
 
killedBy: Async Utilities retryWithBackoff should use exponential backoff
statusReason: expected 0 to be greater than or equal to 90

[Killed] EqualityOperator
src/core/utils/async.ts:210:11
     } catch (error) {
       lastError = error instanceof Error ? error : new Error(String(error));
 
-      if (i < maxRetries) {
+      if (i >= maxRetries) {
         await new Promise((resolve) => setTimeout(resolve, delay));
         delay *= 2; // Exponential backoff
killedBy: Async Utilities retryWithBackoff should use exponential backoff
statusReason: expected 0 to be greater than or equal to 90

[Killed] BlockStatement
src/core/utils/async.ts:210:27
     } catch (error) {
       lastError = error instanceof Error ? error : new Error(String(error));
 
-      if (i < maxRetries) {
-        await new Promise((resolve) => setTimeout(resolve, delay));
-        delay *= 2; // Exponential backoff
-      }
+      if (i < maxRetries) {}
     }
   }
killedBy: Async Utilities retryWithBackoff should use exponential backoff
statusReason: expected 0 to be greater than or equal to 90

[Killed] ArrowFunction
src/core/utils/async.ts:211:27
       lastError = error instanceof Error ? error : new Error(String(error));
 
       if (i < maxRetries) {
-        await new Promise((resolve) => setTimeout(resolve, delay));
+        await new Promise(() => undefined);
         delay *= 2; // Exponential backoff
       }
killedBy: Async Utilities retryWithBackoff should retry on failure
statusReason: Test timed out in 20000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] AssignmentOperator
src/core/utils/async.ts:212:9
 
       if (i < maxRetries) {
         await new Promise((resolve) => setTimeout(resolve, delay));
-        delay *= 2; // Exponential backoff
+        delay /= 2; // Exponential backoff
       }
     }
killedBy: Async Utilities retryWithBackoff should use exponential backoff
statusReason: expected 51 to be greater than or equal to 180

[Killed] BlockStatement
src/core/utils/async.ts:259:30
     return pendingPromise;
   }) as T;
 
-  const cancel = (): void => {
-    if (timeoutId) {
-      clearTimeout(timeoutId);
-      timeoutId = null;
-    }
-    pendingPromise = null;
-  };
+  const cancel = (): void => {};
 
   return Object.assign(debounced, { cancel }) as T & { cancel: () => void };
killedBy: Async Utilities debounceAsync should cancel pending calls
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] BlockStatement
src/core/utils/async.ts:260:20
   }) as T;
 
   const cancel = (): void => {
-    if (timeoutId) {
-      clearTimeout(timeoutId);
-      timeoutId = null;
-    }
+    if (timeoutId) {}
     pendingPromise = null;
   };
killedBy: Async Utilities debounceAsync should cancel pending calls
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []
