[Killed] BooleanLiteral
src/core/utils/security.ts:14:7
  */
 export function escapeShellArg(arg: string): string {
   // If the argument is empty, return empty quotes
-  if (!arg) return "''";
+  if (arg) return "''";
 
   // Replace single quotes with '\'' and wrap in single quotes
killedBy: Property-based tests for security utilities escapeShellArg should handle strings with single quotes
statusReason: Property failed after 1 tests
{ seed: -1397299923, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["'"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/security.ts:14:7
  */
 export function escapeShellArg(arg: string): string {
   // If the argument is empty, return empty quotes
-  if (!arg) return "''";
+  if (true) return "''";
 
   // Replace single quotes with '\'' and wrap in single quotes
killedBy: Security Utilities escapeShellArg should wrap simple strings in single quotes
statusReason: expected '\'\'' to be '\'hello\'' // Object.is equality

[Killed] StringLiteral
src/core/utils/security.ts:18:32
 
   // Replace single quotes with '\'' and wrap in single quotes
   // This works because even in single quotes, '\'' breaks out, adds a literal ', and re-enters
-  return `'${arg.replace(/'/g, "'\\''")}'`;
+  return `'${arg.replace(/'/g, "")}'`;
 }
 
killedBy: Security Utilities escapeShellArg should escape single quotes
statusReason: expected '\'its\'' to be '\'it\'\\'\'s\'' // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:33:7
   const normalizedPath = path.normalize(inputPath);
 
   // Check for path traversal attempts
-  if (normalizedPath.includes('..') || inputPath.includes('..')) {
+  if (false) {
     throw new Error('Path traversal attempt detected');
   }
killedBy: Security Utilities sanitizePath should reject paths with .. traversal
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/core/utils/security.ts:33:66
   const normalizedPath = path.normalize(inputPath);
 
   // Check for path traversal attempts
-  if (normalizedPath.includes('..') || inputPath.includes('..')) {
-    throw new Error('Path traversal attempt detected');
-  }
+  if (normalizedPath.includes('..') || inputPath.includes('..')) {}
 
   // If a base path is provided, ensure the path stays within it
killedBy: Security Utilities sanitizePath should reject paths with .. traversal
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/core/utils/security.ts:38:17
   }
 
   // If a base path is provided, ensure the path stays within it
-  if (basePath) {
-    const resolvedPath = path.resolve(basePath, normalizedPath);
-    const resolvedBase = path.resolve(basePath);
-
-    if (!resolvedPath.startsWith(resolvedBase)) {
-      throw new Error('Path escapes base directory');
-    }
-
-    return resolvedPath;
-  }
+  if (basePath) {}
 
   return path.resolve(normalizedPath);
killedBy: Security Utilities sanitizePath should enforce base path restrictions
statusReason: expected '/home/nazq/dev/claude_gwt/.stryker-tm…' to be '/home/user/project/subdir' // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:42:9
     const resolvedPath = path.resolve(basePath, normalizedPath);
     const resolvedBase = path.resolve(basePath);
 
-    if (!resolvedPath.startsWith(resolvedBase)) {
+    if (resolvedPath.startsWith(resolvedBase)) {
       throw new Error('Path escapes base directory');
     }
killedBy: Security Utilities sanitizePath should enforce base path restrictions
statusReason: Path escapes base directory

[Killed] BlockStatement
src/core/utils/security.ts:42:49
     const resolvedPath = path.resolve(basePath, normalizedPath);
     const resolvedBase = path.resolve(basePath);
 
-    if (!resolvedPath.startsWith(resolvedBase)) {
-      throw new Error('Path escapes base directory');
-    }
+    if (!resolvedPath.startsWith(resolvedBase)) {}
 
     return resolvedPath;
killedBy: Security Utilities sanitizePath should handle absolute paths with base path
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/core/utils/security.ts:58:7
  * @returns true if valid, false otherwise
  */
 export function isValidGitUrl(url: string): boolean {
-  if (!url || typeof url !== 'string') return false;
+  if (url || typeof url !== 'string') return false;
 
   // Check for common Git URL patterns
killedBy: Property-based tests for security utilities isValidGitUrl edge cases should validate generated GitHub URLs
statusReason: Property failed after 1 tests
{ seed: -368138292, path: "0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [["0","A"]]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/core/utils/security.ts:58:47
  * @returns true if valid, false otherwise
  */
 export function isValidGitUrl(url: string): boolean {
-  if (!url || typeof url !== 'string') return false;
+  if (!url || typeof url !== 'string') return true;
 
   // Check for common Git URL patterns
killedBy: Security Utilities isValidGitUrl should reject invalid URLs
statusReason: expected true to be false // Object.is equality

[Killed] Regex
src/core/utils/security.ts:63:5
   // Check for common Git URL patterns
   const patterns = [
     // HTTPS URLs
-    /^https?:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^https?:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\W.-]+)(\.git)?$/,
     // SSH URLs (git@github.com:user/repo.git)
     /^git@([\w.-]+):([\w.-]+)\/([\w.-]+)(\.git)?$/,
killedBy: Property-based tests for security utilities isValidGitUrl edge cases should validate generated GitHub URLs
statusReason: Property failed after 1 tests
{ seed: -1676380031, path: "0:0:0:0:0:0:0:1", endOnFailure: true }
Counterexample: [["0","0"]]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
src/core/utils/security.ts:63:5
   // Check for common Git URL patterns
   const patterns = [
     // HTTPS URLs
-    /^https?:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^https?:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)$/,
     // SSH URLs (git@github.com:user/repo.git)
     /^git@([\w.-]+):([\w.-]+)\/([\w.-]+)(\.git)?$/,
killedBy: Security Utilities isValidGitUrl should validate HTTPS URLs
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/core/utils/security.ts:65:5
     // HTTPS URLs
     /^https?:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // SSH URLs (git@github.com:user/repo.git)
-    /^git@([\w.-]+):([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^git@([\w.-]+):([\w.-])\/([\w.-]+)(\.git)?$/,
     // SSH URLs (ssh://git@github.com/user/repo.git)
     /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
killedBy: Property-based tests for security utilities isValidGitUrl edge cases should validate generated GitHub URLs
statusReason: Property failed after 1 tests
{ seed: 174288668, path: "0:1:0:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [["-0","A"]]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
src/core/utils/security.ts:65:5
     // HTTPS URLs
     /^https?:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // SSH URLs (git@github.com:user/repo.git)
-    /^git@([\w.-]+):([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^git@([\w.-]):([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // SSH URLs (ssh://git@github.com/user/repo.git)
     /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
killedBy: Property-based tests for security utilities isValidGitUrl edge cases should validate generated GitHub URLs
statusReason: Property failed after 1 tests
{ seed: -732548782, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [["0","0"]]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
src/core/utils/security.ts:67:5
     // SSH URLs (git@github.com:user/repo.git)
     /^git@([\w.-]+):([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // SSH URLs (ssh://git@github.com/user/repo.git)
-    /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-])(\.git)?$/,
     // Git protocol
     /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
killedBy: Security Utilities isValidGitUrl should validate SSH URLs
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/core/utils/security.ts:67:5
     // SSH URLs (git@github.com:user/repo.git)
     /^git@([\w.-]+):([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // SSH URLs (ssh://git@github.com/user/repo.git)
-    /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^ssh:\/\/git@([\w.-]+)(:\D+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // Git protocol
     /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
killedBy: Security Utilities isValidGitUrl should validate SSH URLs
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/core/utils/security.ts:69:5
     // SSH URLs (ssh://git@github.com/user/repo.git)
     /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // Git protocol
-    /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^git:\/\/([\w.-])(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // Local file paths (unix)
     /^(\/[\w.-]+)+\/?$/,
killedBy: Security Utilities isValidGitUrl should validate git protocol URLs
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/core/utils/security.ts:69:5
     // SSH URLs (ssh://git@github.com/user/repo.git)
     /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // Git protocol
-    /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-])(\.git)?$/,
     // Local file paths (unix)
     /^(\/[\w.-]+)+\/?$/,
killedBy: Security Utilities isValidGitUrl should validate git protocol URLs
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/core/utils/security.ts:71:5
     // Git protocol
     /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // Local file paths (unix)
-    /^(\/[\w.-]+)+\/?$/,
+    /^(\/[\w.-])+\/?$/,
     // Local file paths (windows)
     /^[a-zA-Z]:\\([\w.-]+\\?)*$/,
killedBy: Security Utilities isValidGitUrl should validate local paths
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/core/utils/security.ts:71:5
     // Git protocol
     /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // Local file paths (unix)
-    /^(\/[\w.-]+)+\/?$/,
+    /^(\/[\w.-]+)+\/$/,
     // Local file paths (windows)
     /^[a-zA-Z]:\\([\w.-]+\\?)*$/,
killedBy: Security Utilities isValidGitUrl should validate local paths
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/core/utils/security.ts:73:5
     // Local file paths (unix)
     /^(\/[\w.-]+)+\/?$/,
     // Local file paths (windows)
-    /^[a-zA-Z]:\\([\w.-]+\\?)*$/,
+    /^[a-zA-Z]:\\([\W.-]+\\?)*$/,
     // File protocol
     /^file:\/\/(\/[\w.-]+)+\/?$/,
killedBy: Security Utilities isValidGitUrl should validate local paths
statusReason: expected false to be true // Object.is equality

[Survived] Regex
src/core/utils/security.ts:73:5
     // Local file paths (unix)
     /^(\/[\w.-]+)+\/?$/,
     // Local file paths (windows)
-    /^[a-zA-Z]:\\([\w.-]+\\?)*$/,
+    /^[a-zA-Z]:\\([\w.-]\\?)*$/,
     // File protocol
     /^file:\/\/(\/[\w.-]+)+\/?$/,

[Killed] Regex
src/core/utils/security.ts:75:5
     // Local file paths (windows)
     /^[a-zA-Z]:\\([\w.-]+\\?)*$/,
     // File protocol
-    /^file:\/\/(\/[\w.-]+)+\/?$/,
+    /^file:\/\/(\/[\w.-]+)+\/$/,
   ];
 
killedBy: Security Utilities isValidGitUrl should validate local paths
statusReason: expected false to be true // Object.is equality

[Survived] Regex
src/core/utils/security.ts:75:5
     // Local file paths (windows)
     /^[a-zA-Z]:\\([\w.-]+\\?)*$/,
     // File protocol
-    /^file:\/\/(\/[\w.-]+)+\/?$/,
+    /^file:\/\/(\/[\w.-]+)+\/?/,
   ];
 

[Killed] ArrowFunction
src/core/utils/security.ts:78:24
     /^file:\/\/(\/[\w.-]+)+\/?$/,
   ];
 
-  return patterns.some((pattern) => pattern.test(url));
+  return patterns.some(() => undefined);
 }
 
killedBy: Security Utilities isValidGitUrl should validate HTTPS URLs
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/core/utils/security.ts:78:10
     /^file:\/\/(\/[\w.-]+)+\/?$/,
   ];
 
-  return patterns.some((pattern) => pattern.test(url));
+  return patterns.every(pattern => pattern.test(url));
 }
 
killedBy: Security Utilities isValidGitUrl should validate HTTPS URLs
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:87:49
  * @returns true if valid, false otherwise
  */
 export function isValidBranchName(name: string): boolean {
-  if (!name || typeof name !== 'string') return false;
+  if (!name || typeof name !== 'string') return true;
 
   // Git branch name rules:
killedBy: Security Utilities isValidBranchName should reject invalid branch names
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:87:7
  * @returns true if valid, false otherwise
  */
 export function isValidBranchName(name: string): boolean {
-  if (!name || typeof name !== 'string') return false;
+  if (true) return false;
 
   // Git branch name rules:
killedBy: Security Utilities isValidBranchName should accept valid branch names
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:96:7
   // - Cannot end with a slash
   // - Cannot end with .lock
 
-  if (name.startsWith('.')) return false;
+  if (false) return false;
   if (name.includes('..')) return false;
   if (name.endsWith('/')) return false;
killedBy: Security Utilities isValidBranchName should reject invalid branch names
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:96:36
   // - Cannot end with a slash
   // - Cannot end with .lock
 
-  if (name.startsWith('.')) return false;
+  if (name.startsWith('.')) return true;
   if (name.includes('..')) return false;
   if (name.endsWith('/')) return false;
killedBy: Security Utilities isValidBranchName should reject invalid branch names
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:97:7
   // - Cannot end with .lock
 
   if (name.startsWith('.')) return false;
-  if (name.includes('..')) return false;
+  if (true) return false;
   if (name.endsWith('/')) return false;
   if (name.includes('.lock')) return false;
killedBy: Property-based tests for security utilities isValidBranchName should accept valid branch names
statusReason: Property failed after 1 tests
{ seed: -674063966, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["00"]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/core/utils/security.ts:97:35
   // - Cannot end with .lock
 
   if (name.startsWith('.')) return false;
-  if (name.includes('..')) return false;
+  if (name.includes('..')) return true;
   if (name.endsWith('/')) return false;
   if (name.includes('.lock')) return false;
killedBy: Security Utilities isValidBranchName should reject invalid branch names
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:98:34
 
   if (name.startsWith('.')) return false;
   if (name.includes('..')) return false;
-  if (name.endsWith('/')) return false;
+  if (name.endsWith('/')) return true;
   if (name.includes('.lock')) return false;
 
killedBy: Security Utilities isValidBranchName should reject invalid branch names
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:98:7
 
   if (name.startsWith('.')) return false;
   if (name.includes('..')) return false;
-  if (name.endsWith('/')) return false;
+  if (false) return false;
   if (name.includes('.lock')) return false;
 
killedBy: Security Utilities isValidBranchName should reject invalid branch names
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:99:7
   if (name.startsWith('.')) return false;
   if (name.includes('..')) return false;
   if (name.endsWith('/')) return false;
-  if (name.includes('.lock')) return false;
+  if (false) return false;
 
   const invalidChars = /[\s~^:?*[\\\]@{]/;
killedBy: Property-based tests for security utilities isValidBranchName should reject dangerous patterns
statusReason: Property failed after 7 tests
{ seed: -1654410487, path: "6:1:2:1:1:1:1:1:2", endOnFailure: true }
Counterexample: [["!",".lock",""]]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/security.ts:99:7
   if (name.startsWith('.')) return false;
   if (name.includes('..')) return false;
   if (name.endsWith('/')) return false;
-  if (name.includes('.lock')) return false;
+  if (true) return false;
 
   const invalidChars = /[\s~^:?*[\\\]@{]/;
killedBy: Security Utilities isValidBranchName should accept valid branch names
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:102:39
   if (name.includes('.lock')) return false;
 
   const invalidChars = /[\s~^:?*[\\\]@{]/;
-  if (invalidChars.test(name)) return false;
+  if (invalidChars.test(name)) return true;
 
   // Must be non-empty after trimming
killedBy: Property-based tests for security utilities isValidBranchName should reject dangerous patterns
statusReason: Property failed after 1 tests
{ seed: 560630010, path: "0:0:0", endOnFailure: true }
Counterexample: [["","@{",""]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/security.ts:102:7
   if (name.includes('.lock')) return false;
 
   const invalidChars = /[\s~^:?*[\\\]@{]/;
-  if (invalidChars.test(name)) return false;
+  if (false) return false;
 
   // Must be non-empty after trimming
killedBy: Security Utilities isValidBranchName should reject invalid branch names
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/utils/security.ts:105:10
   if (invalidChars.test(name)) return false;
 
   // Must be non-empty after trimming
-  return name.trim().length > 0;
+  return name.trim().length <= 0;
 }
 
killedBy: Property-based tests for security utilities isValidBranchName should accept valid branch names
statusReason: Property failed after 1 tests
{ seed: -1495856674, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["00"]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/security.ts:105:10
   if (invalidChars.test(name)) return false;
 
   // Must be non-empty after trimming
-  return name.trim().length > 0;
+  return false;
 }
 
killedBy: Property-based tests for security utilities isValidBranchName should accept valid branch names
statusReason: Property failed after 1 tests
{ seed: -1034966497, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["0A"]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/security.ts:114:7
  * @returns The sanitized session name
  */
 export function sanitizeSessionName(name: string): string {
-  if (!name) return '';
+  if (true) return '';
 
   // Tmux session names cannot contain colons or dots
killedBy: Security Utilities sanitizeSessionName should sanitize tmux session names
statusReason: expected '' to be 'project_branch' // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:114:7
  * @returns The sanitized session name
  */
 export function sanitizeSessionName(name: string): string {
-  if (!name) return '';
+  if (name) return '';
 
   // Tmux session names cannot contain colons or dots
killedBy: Security Utilities sanitizeSessionName should sanitize tmux session names
statusReason: expected '' to be 'project_branch' // Object.is equality

[Killed] MethodExpression
src/core/utils/security.ts:118:10
 
   // Tmux session names cannot contain colons or dots
   // Replace invalid characters with underscores before removing other chars
-  return name
-    .replace(/[:./\s]+/g, '_') // Replace colons, dots, slashes, spaces with underscore
-    .replace(/[^a-zA-Z0-9_-]/g, '') // Remove any other invalid characters
-    .substring(0, 50); // Limit length
+  return name.replace(/[:./\s]+/g, '_') // Replace colons, dots, slashes, spaces with underscore
+.replace(/[^a-zA-Z0-9_-]/g, '') // Remove any other invalid characters; // Limit length
 }
 
killedBy: Security Utilities sanitizeSessionName should limit length
statusReason: expected 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa…' to have a length of 50 but got 60

[Survived] Regex
src/core/utils/security.ts:119:14
   // Tmux session names cannot contain colons or dots
   // Replace invalid characters with underscores before removing other chars
   return name
-    .replace(/[:./\s]+/g, '_') // Replace colons, dots, slashes, spaces with underscore
+    .replace(/[:./\s]/g, '_') // Replace colons, dots, slashes, spaces with underscore
     .replace(/[^a-zA-Z0-9_-]/g, '') // Remove any other invalid characters
     .substring(0, 50); // Limit length

[Killed] StringLiteral
src/core/utils/security.ts:120:33
   // Replace invalid characters with underscores before removing other chars
   return name
     .replace(/[:./\s]+/g, '_') // Replace colons, dots, slashes, spaces with underscore
-    .replace(/[^a-zA-Z0-9_-]/g, '') // Remove any other invalid characters
+    .replace(/[^a-zA-Z0-9_-]/g, "Stryker was here!") // Remove any other invalid characters
     .substring(0, 50); // Limit length
 }
killedBy: Security Utilities sanitizeSessionName should remove invalid characters
statusReason: expected 'projectStryker was here!Stryker was h…' to be 'project' // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:130:7
  * @returns true if valid, false otherwise
  */
 export function isValidDirectoryName(name: string): boolean {
-  if (!name || typeof name !== 'string') return false;
+  if (name || typeof name !== 'string') return false;
 
   // Check for path traversal
killedBy: Security Utilities isValidDirectoryName should accept valid directory names
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:130:7
  * @returns true if valid, false otherwise
  */
 export function isValidDirectoryName(name: string): boolean {
-  if (!name || typeof name !== 'string') return false;
+  if (false) return false;
 
   // Check for path traversal
killedBy: Security Utilities isValidDirectoryName should reject invalid directory names
statusReason: Cannot read properties of null (reading 'includes')

[Killed] LogicalOperator
src/core/utils/security.ts:133:7
   if (!name || typeof name !== 'string') return false;
 
   // Check for path traversal
-  if (name.includes('..') || name.includes('/') || name.includes('\\')) {
+  if (name.includes('..') && name.includes('/') || name.includes('\\')) {
     return false;
   }
killedBy: Security Utilities isValidDirectoryName should reject invalid directory names
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/utils/security.ts:133:73
   if (!name || typeof name !== 'string') return false;
 
   // Check for path traversal
-  if (name.includes('..') || name.includes('/') || name.includes('\\')) {
-    return false;
-  }
+  if (name.includes('..') || name.includes('/') || name.includes('\\')) {}
 
   // Check for invalid characters (including control characters)
killedBy: Security Utilities isValidDirectoryName should reject invalid directory names
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:134:12
 
   // Check for path traversal
   if (name.includes('..') || name.includes('/') || name.includes('\\')) {
-    return false;
+    return true;
   }
 
killedBy: Security Utilities isValidDirectoryName should reject invalid directory names
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:140:7
   // Check for invalid characters (including control characters)
   // eslint-disable-next-line no-control-regex
   const invalidChars = /[<>:"|?*\x00-\x1F\x7F]/;
-  if (invalidChars.test(name)) return false;
+  if (true) return false;
 
   // Must be non-empty after trimming
killedBy: Security Utilities isValidDirectoryName should accept valid directory names
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:140:7
   // Check for invalid characters (including control characters)
   // eslint-disable-next-line no-control-regex
   const invalidChars = /[<>:"|?*\x00-\x1F\x7F]/;
-  if (invalidChars.test(name)) return false;
+  if (false) return false;
 
   // Must be non-empty after trimming
killedBy: Security Utilities isValidDirectoryName should reject invalid directory names
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:152:7
  * @returns The escaped string
  */
 export function escapeTmuxArg(str: string): string {
-  if (!str) return "''";
+  if (true) return "''";
 
   // Tmux uses similar escaping to shell, but we need to be extra careful
killedBy: Additional coverage for uncovered functions Security utilities should test escapeTmuxArg
statusReason: expected '\'\'' to be '\'simple\'' // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:152:7
  * @returns The escaped string
  */
 export function escapeTmuxArg(str: string): string {
-  if (!str) return "''";
+  if (str) return "''";
 
   // Tmux uses similar escaping to shell, but we need to be extra careful
killedBy: Additional coverage for uncovered functions Security utilities should test escapeTmuxArg
statusReason: expected '\'\'' to be '\'simple\'' // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:168:20
  * @returns true if safe, false if contains metacharacters
  */
 export function isSafeForShell(str: string): boolean {
-  if (!str) return true;
+  if (!str) return false;
 
   // Check for common shell metacharacters
killedBy: Security Utilities isSafeForShell should accept safe strings
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/security.ts:168:7
  * @returns true if safe, false if contains metacharacters
  */
 export function isSafeForShell(str: string): boolean {
-  if (!str) return true;
+  if (true) return true;
 
   // Check for common shell metacharacters
killedBy: Security Utilities isSafeForShell should reject strings with shell metacharacters
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:172:10
 
   // Check for common shell metacharacters
   const dangerous = /[;&|`$<>(){}[\]!*?~\n\r]/;
-  return !dangerous.test(str);
+  return dangerous.test(str);
 }
 
killedBy: Property-based tests for security utilities isSafeForShell should reject strings with shell metacharacters
statusReason: Property failed after 1 tests
{ seed: -219481603, path: "0:0:0", endOnFailure: true }
Counterexample: [["","&",""]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/core/utils/security.ts:181:7
  * @returns The safe value
  */
 export function safeEnvValue(value: string): string {
-  if (!value) return '';
+  if (true) return '';
 
   // Remove any null bytes and control characters
killedBy: Additional coverage for uncovered functions Security utilities should test safeEnvValue
statusReason: expected '' to be '\'normal\'' // Object.is equality

[Killed] BooleanLiteral
src/core/utils/security.ts:181:7
  * @returns The safe value
  */
 export function safeEnvValue(value: string): string {
-  if (!value) return '';
+  if (value) return '';
 
   // Remove any null bytes and control characters
killedBy: Security Utilities safeEnvValue should handle normal values
statusReason: expected '' to be '\'simple\'' // Object.is equality
