[Killed] BlockStatement
src/core/utils/security.ts:12:53
  * @param arg The argument to escape
  * @returns The escaped argument safe for shell execution
  */
-export function escapeShellArg(arg: string): string {
-  // If the argument is empty, return empty quotes
-  if (!arg) return "''";
-
-  // Replace single quotes with '\'' and wrap in single quotes
-  // This works because even in single quotes, '\'' breaks out, adds a literal ', and re-enters
-  return `'${arg.replace(/'/g, "'\\''")}'`;
-}
+export function escapeShellArg(arg: string): string {}
 
 /**
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BlockStatement
src/core/utils/security.ts:28:76
  * @returns The normalized, safe path
  * @throws Error if the path is invalid or attempts traversal
  */
-export function sanitizePath(inputPath: string, basePath?: string): string {
-  // Normalize the path to resolve . and .. segments
-  const normalizedPath = path.normalize(inputPath);
-
-  // Check for path traversal attempts
-  if (normalizedPath.includes('..') || inputPath.includes('..')) {
-    throw new Error('Path traversal attempt detected');
-  }
-
-  // If a base path is provided, ensure the path stays within it
-  if (basePath) {
-    const resolvedPath = path.resolve(basePath, normalizedPath);
-    const resolvedBase = path.resolve(basePath);
-
-    if (!resolvedPath.startsWith(resolvedBase)) {
-      throw new Error('Path escapes base directory');
-    }
-
-    return resolvedPath;
-  }
-
-  return path.resolve(normalizedPath);
-}
+export function sanitizePath(inputPath: string, basePath?: string): string {}
 
 /**
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] ConditionalExpression
src/core/utils/security.ts:33:7
   const normalizedPath = path.normalize(inputPath);
 
   // Check for path traversal attempts
-  if (normalizedPath.includes('..') || inputPath.includes('..')) {
+  if (true) {
     throw new Error('Path traversal attempt detected');
   }
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts




 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] ConditionalExpression
src/core/utils/security.ts:38:7
   }
 
   // If a base path is provided, ensure the path stays within it
-  if (basePath) {
+  if (false) {
     const resolvedPath = path.resolve(basePath, normalizedPath);
     const resolvedBase = path.resolve(basePath);
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts




 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BlockStatement
src/core/utils/security.ts:57:53
  * @param url The URL to validate
  * @returns true if valid, false otherwise
  */
-export function isValidGitUrl(url: string): boolean {
-  if (!url || typeof url !== 'string') return false;
-
-  // Check for common Git URL patterns
-  const patterns = [
-    // HTTPS URLs
-    /^https?:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
-    // SSH URLs (git@github.com:user/repo.git)
-    /^git@([\w.-]+):([\w.-]+)\/([\w.-]+)(\.git)?$/,
-    // SSH URLs (ssh://git@github.com/user/repo.git)
-    /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
-    // Git protocol
-    /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
-    // Local file paths (unix)
-    /^(\/[\w.-]+)+\/?$/,
-    // Local file paths (windows)
-    /^[a-zA-Z]:\\([\w.-]+\\?)*$/,
-    // File protocol
-    /^file:\/\/(\/[\w.-]+)+\/?$/,
-  ];
-
-  return patterns.some((pattern) => pattern.test(url));
-}
+export function isValidGitUrl(url: string): boolean {}
 
 /**
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts




 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] ArrayDeclaration
src/core/utils/security.ts:61:20
   if (!url || typeof url !== 'string') return false;
 
   // Check for common Git URL patterns
-  const patterns = [
-    // HTTPS URLs
-    /^https?:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
-    // SSH URLs (git@github.com:user/repo.git)
-    /^git@([\w.-]+):([\w.-]+)\/([\w.-]+)(\.git)?$/,
-    // SSH URLs (ssh://git@github.com/user/repo.git)
-    /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
-    // Git protocol
-    /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
-    // Local file paths (unix)
-    /^(\/[\w.-]+)+\/?$/,
-    // Local file paths (windows)
-    /^[a-zA-Z]:\\([\w.-]+\\?)*$/,
-    // File protocol
-    /^file:\/\/(\/[\w.-]+)+\/?$/,
-  ];
+  const patterns = [];
 
   return patterns.some((pattern) => pattern.test(url));
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] Regex
src/core/utils/security.ts:69:5
     // SSH URLs (ssh://git@github.com/user/repo.git)
     /^ssh:\/\/git@([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
     // Git protocol
-    /^git:\/\/([\w.-]+)(:\d+)?\/([\w.-]+)\/([\w.-]+)(\.git)?$/,
+    /^git:\/\/([\w.-]+)(:\d+)?\/([\W.-]+)\/([\w.-]+)(\.git)?$/,
     // Local file paths (unix)
     /^(\/[\w.-]+)+\/?$/,
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts




 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BlockStatement
src/core/utils/security.ts:86:58
  * @param name The branch name to validate
  * @returns true if valid, false otherwise
  */
-export function isValidBranchName(name: string): boolean {
-  if (!name || typeof name !== 'string') return false;
-
-  // Git branch name rules:
-  // - Cannot start with a dot
-  // - Cannot contain two consecutive dots
-  // - Cannot contain space, ~, ^, :, ?, *, [, \, @{
-  // - Cannot end with a slash
-  // - Cannot end with .lock
-
-  if (name.startsWith('.')) return false;
-  if (name.includes('..')) return false;
-  if (name.endsWith('/')) return false;
-  if (name.endsWith('.lock')) return false;
-
-  const invalidChars = /[\s~^:?*[\\\]@{]/;
-  if (invalidChars.test(name)) return false;
-
-  // Must be non-empty after trimming
-  return name.trim().length > 0;
-}
+export function isValidBranchName(name: string): boolean {}
 
 /**
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] ConditionalExpression
src/core/utils/security.ts:96:7
   // - Cannot end with a slash
   // - Cannot end with .lock
 
-  if (name.startsWith('.')) return false;
+  if (true) return false;
   if (name.includes('..')) return false;
   if (name.endsWith('/')) return false;
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] ConditionalExpression
src/core/utils/security.ts:97:7
   // - Cannot end with .lock
 
   if (name.startsWith('.')) return false;
-  if (name.includes('..')) return false;
+  if (false) return false;
   if (name.endsWith('/')) return false;
   if (name.endsWith('.lock')) return false;
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] ConditionalExpression
src/core/utils/security.ts:99:7
   if (name.startsWith('.')) return false;
   if (name.includes('..')) return false;
   if (name.endsWith('/')) return false;
-  if (name.endsWith('.lock')) return false;
+  if (false) return false;
 
   const invalidChars = /[\s~^:?*[\\\]@{]/;
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Timeout] ConditionalExpression
src/core/utils/security.ts:99:7
   if (name.startsWith('.')) return false;
   if (name.includes('..')) return false;
   if (name.endsWith('/')) return false;
-  if (name.endsWith('.lock')) return false;
+  if (true) return false;
 
   const invalidChars = /[\s~^:?*[\\\]@{]/;

[Timeout] BlockStatement
src/core/utils/security.ts:113:59
  * @param name The session name to sanitize
  * @returns The sanitized session name
  */
-export function sanitizeSessionName(name: string): string {
-  if (!name) return '';
-
-  // Tmux session names cannot contain colons or dots
-  // Replace invalid characters with underscores before removing other chars
-  return name
-    .replace(/[:./\s]+/g, '_') // Replace colons, dots, slashes, spaces with underscore
-    .replace(/[^a-zA-Z0-9_-]/g, '') // Remove any other invalid characters
-    .substring(0, 50); // Limit length
-}
+export function sanitizeSessionName(name: string): string {}
 
 /**

[Survived] ConditionalExpression
src/core/utils/security.ts:114:7
  * @returns The sanitized session name
  */
 export function sanitizeSessionName(name: string): string {
-  if (!name) return '';
+  if (false) return '';
 
   // Tmux session names cannot contain colons or dots

[Killed] BlockStatement
src/core/utils/security.ts:129:61
  * @param name The directory name to validate
  * @returns true if valid, false otherwise
  */
-export function isValidDirectoryName(name: string): boolean {
-  if (!name || typeof name !== 'string') return false;
-
-  // Check for path traversal
-  if (name.includes('..') || name.includes('/') || name.includes('\\')) {
-    return false;
-  }
-
-  // Check for invalid characters (including control characters)
-  // eslint-disable-next-line no-control-regex
-  const invalidChars = /[<>:"|?*\x00-\x1F\x7F]/;
-  if (invalidChars.test(name)) return false;
-
-  // Must be non-empty after trimming
-  return name.trim().length > 0;
-}
+export function isValidDirectoryName(name: string): boolean {}
 
 /**
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts




 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BooleanLiteral
src/core/utils/security.ts:130:49
  * @returns true if valid, false otherwise
  */
 export function isValidDirectoryName(name: string): boolean {
-  if (!name || typeof name !== 'string') return false;
+  if (!name || typeof name !== 'string') return true;
 
   // Check for path traversal
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BooleanLiteral
src/core/utils/security.ts:140:39
   // Check for invalid characters (including control characters)
   // eslint-disable-next-line no-control-regex
   const invalidChars = /[<>:"|?*\x00-\x1F\x7F]/;
-  if (invalidChars.test(name)) return false;
+  if (invalidChars.test(name)) return true;
 
   // Must be non-empty after trimming
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BlockStatement
src/core/utils/security.ts:151:52
  * @param str The string to escape
  * @returns The escaped string
  */
-export function escapeTmuxArg(str: string): string {
-  if (!str) return "''";
-
-  // Tmux uses similar escaping to shell, but we need to be extra careful
-  // First escape for shell, then handle tmux-specific escaping
-  const shellEscaped = escapeShellArg(str);
-
-  // Tmux interprets backslashes, so we need to escape them
-  return shellEscaped.replace(/\\/g, '\\\\');
-}
+export function escapeTmuxArg(str: string): string {}
 
 /**
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BlockStatement
src/core/utils/security.ts:167:54
  * @param str The string to check
  * @returns true if safe, false if contains metacharacters
  */
-export function isSafeForShell(str: string): boolean {
-  if (!str) return true;
-
-  // Check for common shell metacharacters
-  const dangerous = /[;&|`$<>(){}[\]!*?~\n\r]/;
-  return !dangerous.test(str);
-}
+export function isSafeForShell(str: string): boolean {}
 
 /**
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BooleanLiteral
src/core/utils/security.ts:168:7
  * @returns true if safe, false if contains metacharacters
  */
 export function isSafeForShell(str: string): boolean {
-  if (!str) return true;
+  if (str) return true;
 
   // Check for common shell metacharacters
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID

[Killed] BlockStatement
src/core/utils/security.ts:180:53
  * @param value The value to make safe
  * @returns The safe value
  */
-export function safeEnvValue(value: string): string {
-  if (!value) return '';
-
-  // Remove any null bytes and control characters
-  // eslint-disable-next-line no-control-regex
-  value = value.replace(/[\x00-\x1F\x7F]/g, '');
-
-  // Escape special characters for shell environment
-  return escapeShellArg(value);
-}
+export function safeEnvValue(value: string): string {}
 
killedBy: All tests
statusReason: > claude-gwt@0.3.0-beta.1751891532 test
> vitest run tests/unit/core/utils/security.test.ts



 RUN  v2.1.9 /home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-yhyIID
