[Survived] LogicalOperator
src/core/utils/logger.ts:26:19
     isDevelopment?: boolean;
     context?: LogContext;
   }) {
-    const isDev = options?.isDevelopment ?? process.env['NODE_ENV'] === 'development';
+    const isDev = options?.isDevelopment && process.env['NODE_ENV'] === 'development';
 
     // For testing: Use pino-test for proper test logging

[Survived] ConditionalExpression
src/core/utils/logger.ts:26:45
     isDevelopment?: boolean;
     context?: LogContext;
   }) {
-    const isDev = options?.isDevelopment ?? process.env['NODE_ENV'] === 'development';
+    const isDev = options?.isDevelopment ?? true;
 
     // For testing: Use pino-test for proper test logging

[Killed] ConditionalExpression
src/core/utils/logger.ts:30:7
 
     // For testing: Use pino-test for proper test logging
     const isTest =
-      process.env['NODE_ENV'] === 'test' ||
-      process.env['VITEST'] !== undefined ||
-      process.env['NODE_ENV'] === 'testing';
+      true;
 
     const pinoOptions: pino.LoggerOptions = {
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Survived] LogicalOperator
src/core/utils/logger.ts:30:7
 
     // For testing: Use pino-test for proper test logging
     const isTest =
-      process.env['NODE_ENV'] === 'test' ||
-      process.env['VITEST'] !== undefined ||
+      process.env['NODE_ENV'] === 'test' && process.env['VITEST'] !== undefined ||
       process.env['NODE_ENV'] === 'testing';
 

[Killed] EqualityOperator
src/core/utils/logger.ts:31:7
     // For testing: Use pino-test for proper test logging
     const isTest =
       process.env['NODE_ENV'] === 'test' ||
-      process.env['VITEST'] !== undefined ||
+      process.env['VITEST'] === undefined ||
       process.env['NODE_ENV'] === 'testing';
 
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Survived] ConditionalExpression
src/core/utils/logger.ts:31:7
     // For testing: Use pino-test for proper test logging
     const isTest =
       process.env['NODE_ENV'] === 'test' ||
-      process.env['VITEST'] !== undefined ||
+      false ||
       process.env['NODE_ENV'] === 'testing';
 

[Killed] EqualityOperator
src/core/utils/logger.ts:32:7
     const isTest =
       process.env['NODE_ENV'] === 'test' ||
       process.env['VITEST'] !== undefined ||
-      process.env['NODE_ENV'] === 'testing';
+      process.env['NODE_ENV'] !== 'testing';
 
     const pinoOptions: pino.LoggerOptions = {
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Survived] ConditionalExpression
src/core/utils/logger.ts:32:7
     const isTest =
       process.env['NODE_ENV'] === 'test' ||
       process.env['VITEST'] !== undefined ||
-      process.env['NODE_ENV'] === 'testing';
+      false;
 
     const pinoOptions: pino.LoggerOptions = {

[Survived] LogicalOperator
src/core/utils/logger.ts:35:13
       process.env['NODE_ENV'] === 'testing';
 
     const pinoOptions: pino.LoggerOptions = {
-      name: options?.name ?? 'claude-gwt',
+      name: options?.name && 'claude-gwt',
       level: options?.level ?? (isDev ? 'debug' : 'info'),
       base: {

[Survived] LogicalOperator
src/core/utils/logger.ts:36:14
 
     const pinoOptions: pino.LoggerOptions = {
       name: options?.name ?? 'claude-gwt',
-      level: options?.level ?? (isDev ? 'debug' : 'info'),
+      level: options?.level && (isDev ? 'debug' : 'info'),
       base: {
         pid: process.pid,

[Survived] ObjectLiteral
src/core/utils/logger.ts:37:13
     const pinoOptions: pino.LoggerOptions = {
       name: options?.name ?? 'claude-gwt',
       level: options?.level ?? (isDev ? 'debug' : 'info'),
-      base: {
-        pid: process.pid,
-        hostname: undefined, // Remove hostname for cleaner logs
-      },
+      base: {},
     };
 

[Killed] ConditionalExpression
src/core/utils/logger.ts:43:9
       },
     };
 
-    if (isTest) {
+    if (true) {
       // Testing mode: Use pino-test for proper testing
       pinoOptions.level = 'silent';
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Survived] ConditionalExpression
src/core/utils/logger.ts:43:9
       },
     };
 
-    if (isTest) {
+    if (false) {
       // Testing mode: Use pino-test for proper testing
       pinoOptions.level = 'silent';

[Killed] StringLiteral
src/core/utils/logger.ts:45:27
 
     if (isTest) {
       // Testing mode: Use pino-test for proper testing
-      pinoOptions.level = 'silent';
+      pinoOptions.level = "";
       this.baseLogger = pino(pinoOptions);
     } else if (isDev) {
killedBy: WorktreeManager getBranchesWithoutWorktrees should throw GitOperationError when git branch fails
statusReason: expected error to be instance of GitOperationError

[Killed] ConditionalExpression
src/core/utils/logger.ts:47:16
       // Testing mode: Use pino-test for proper testing
       pinoOptions.level = 'silent';
       this.baseLogger = pino(pinoOptions);
-    } else if (isDev) {
+    } else if (true) {
       // Development: beautiful pretty print to stdout
       pinoOptions.transport = {
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Survived] ConditionalExpression
src/core/utils/logger.ts:47:16
       // Testing mode: Use pino-test for proper testing
       pinoOptions.level = 'silent';
       this.baseLogger = pino(pinoOptions);
-    } else if (isDev) {
+    } else if (false) {
       // Development: beautiful pretty print to stdout
       pinoOptions.transport = {

[Survived] BooleanLiteral
src/core/utils/logger.ts:55:23
           colorize: true,
           translateTime: 'SYS:yyyy-mm-dd HH:MM:ss.l',
           ignore: 'pid,hostname',
-          singleLine: false,
+          singleLine: true,
           hideObject: false,
           messageFormat: '{msg}',

[Survived] BooleanLiteral
src/core/utils/logger.ts:56:23
           translateTime: 'SYS:yyyy-mm-dd HH:MM:ss.l',
           ignore: 'pid,hostname',
           singleLine: false,
-          hideObject: false,
+          hideObject: true,
           messageFormat: '{msg}',
           customPrettifiers: {

[Survived] ArrowFunction
src/core/utils/logger.ts:59:19
           hideObject: false,
           messageFormat: '{msg}',
           customPrettifiers: {
-            time: (timestamp: string): string => `🕐 ${timestamp}`,
+            time: () => undefined
             level: (logLevel: string): string => {
               const levelEmojis: Record<string, string> = {

[NoCoverage] ObjectLiteral
src/core/utils/logger.ts:61:59
           customPrettifiers: {
             time: (timestamp: string): string => `🕐 ${timestamp}`,
             level: (logLevel: string): string => {
-              const levelEmojis: Record<string, string> = {
-                trace: '🔍',
-                debug: '🐛',
-                info: '📋',
-                warn: '⚠️',
-                error: '❌',
-                fatal: '💀',
-              };
+              const levelEmojis: Record<string, string> = {};
               return `${levelEmojis[logLevel] ?? '📋'} ${logLevel.toUpperCase()}`;
             },

[NoCoverage] StringLiteral
src/core/utils/logger.ts:62:24
             time: (timestamp: string): string => `🕐 ${timestamp}`,
             level: (logLevel: string): string => {
               const levelEmojis: Record<string, string> = {
-                trace: '🔍',
+                trace: ""
                 debug: '🐛',
                 info: '📋',

[NoCoverage] StringLiteral
src/core/utils/logger.ts:65:23
                 trace: '🔍',
                 debug: '🐛',
                 info: '📋',
-                warn: '⚠️',
+                warn: "",
                 error: '❌',
                 fatal: '💀',

[NoCoverage] LogicalOperator
src/core/utils/logger.ts:69:25
                 error: '❌',
                 fatal: '💀',
               };
-              return `${levelEmojis[logLevel] ?? '📋'} ${logLevel.toUpperCase()}`;
+              return `${levelEmojis[logLevel] && '📋' ${logLevel.toUpperCase()}`;
             },
             operation: (operation: string): string => `⚡ ${operation}`,

[NoCoverage] MethodExpression
src/core/utils/logger.ts:69:58
                 error: '❌',
                 fatal: '💀',
               };
-              return `${levelEmojis[logLevel] ?? '📋'} ${logLevel.toUpperCase()}`;
+              return `${levelEmojis[logLevel] ?? '📋'} ${llogLevel.toLowerCase()`;
             },
             operation: (operation: string): string => `⚡ ${operation}`,

[Survived] ArrowFunction
src/core/utils/logger.ts:71:24
               };
               return `${levelEmojis[logLevel] ?? '📋'} ${logLevel.toUpperCase()}`;
             },
-            operation: (operation: string): string => `⚡ ${operation}`,
+            operation: () => undefined,
             branchName: (branch: string): string => `🌿 ${branch}`,
             sessionId: (id: string): string => `🎯 ${id}`,

[Survived] ArrowFunction
src/core/utils/logger.ts:72:25
               return `${levelEmojis[logLevel] ?? '📋'} ${logLevel.toUpperCase()}`;
             },
             operation: (operation: string): string => `⚡ ${operation}`,
-            branchName: (branch: string): string => `🌿 ${branch}`,
+            branchName: () => undefined
             sessionId: (id: string): string => `🎯 ${id}`,
             worktreePath: (path: string): string => `📁 ${path}`,

[Survived] ArrowFunction
src/core/utils/logger.ts:73:24
             },
             operation: (operation: string): string => `⚡ ${operation}`,
             branchName: (branch: string): string => `🌿 ${branch}`,
-            sessionId: (id: string): string => `🎯 ${id}`,
+            sessionId: () => undefined
             worktreePath: (path: string): string => `📁 ${path}`,
             duration: (ms: number): string => `⏱️ ${ms}ms`,

[NoCoverage] StringLiteral
src/core/utils/logger.ts:73:48
             },
             operation: (operation: string): string => `⚡ ${operation}`,
             branchName: (branch: string): string => `🌿 ${branch}`,
-            sessionId: (id: string): string => `🎯 ${id}`,
+            sessionId: (id: string): string => ``
             worktreePath: (path: string): string => `📁 ${path}`,
             duration: (ms: number): string => `⏱️ ${ms}ms`,

[Survived] ArrowFunction
src/core/utils/logger.ts:74:27
             operation: (operation: string): string => `⚡ ${operation}`,
             branchName: (branch: string): string => `🌿 ${branch}`,
             sessionId: (id: string): string => `🎯 ${id}`,
-            worktreePath: (path: string): string => `📁 ${path}`,
+            worktreePath: () => undefined
             duration: (ms: number): string => `⏱️ ${ms}ms`,
             logType: (type: string): string => {

[NoCoverage] StringLiteral
src/core/utils/logger.ts:74:53
             operation: (operation: string): string => `⚡ ${operation}`,
             branchName: (branch: string): string => `🌿 ${branch}`,
             sessionId: (id: string): string => `🎯 ${id}`,
-            worktreePath: (path: string): string => `📁 ${path}`,
+            worktreePath: (path: string): string => ``
             duration: (ms: number): string => `⏱️ ${ms}ms`,
             logType: (type: string): string => {

[Survived] ArrowFunction
src/core/utils/logger.ts:75:23
             branchName: (branch: string): string => `🌿 ${branch}`,
             sessionId: (id: string): string => `🎯 ${id}`,
             worktreePath: (path: string): string => `📁 ${path}`,
-            duration: (ms: number): string => `⏱️ ${ms}ms`,
+            duration: () => undefined,
             logType: (type: string): string => {
               const typeEmojis: Record<string, string> = {

[NoCoverage] StringLiteral
src/core/utils/logger.ts:79:26
             logType: (type: string): string => {
               const typeEmojis: Record<string, string> = {
                 success: '✅',
-                failure: '❌',
+                failure: "",
                 progress: '🔄',
                 milestone: '🎉',

[NoCoverage] StringLiteral
src/core/utils/logger.ts:81:28
                 success: '✅',
                 failure: '❌',
                 progress: '🔄',
-                milestone: '🎉',
+                milestone: ""
               };
               return typeEmojis[type] ?? type;

[Survived] ArrowFunction
src/core/utils/logger.ts:85:18
               };
               return typeEmojis[type] ?? type;
             },
-            err: (error: Error): string => `💥 ${error.name}: ${error.message}`,
+            err: () => undefined
             error: (error: unknown): string => `💥 ${JSON.stringify(error)}`,
           },

[Survived] ArrowFunction
src/core/utils/logger.ts:86:20
               return typeEmojis[type] ?? type;
             },
             err: (error: Error): string => `💥 ${error.name}: ${error.message}`,
-            error: (error: unknown): string => `💥 ${JSON.stringify(error)}`,
+            error: () => undefined
           },
           messageKey: 'msg',

[Survived] StringLiteral
src/core/utils/logger.ts:89:21
             error: (error: unknown): string => `💥 ${JSON.stringify(error)}`,
           },
           messageKey: 'msg',
-          levelKey: 'level',
+          levelKey: "",
           timestampKey: 'time',
         },

[Survived] BooleanLiteral
src/core/utils/logger.ts:99:15
       const logFile = path.join(process.cwd(), '.claude-gwt.log');
       const dest = pino.destination({
         dest: logFile,
-        sync: false,
+        sync: true,
       });
 

[Killed] BlockStatement
src/core/utils/logger.ts:109:35
     this.context = options?.context ?? {};
   }
 
-  private ensureGitIgnore(): void {
-    const gitignorePath = path.join(process.cwd(), '.gitignore');
-    const logFileName = '.claude-gwt.log';
-
-    try {
-      if (fs.existsSync(gitignorePath)) {
-        const content = fs.readFileSync(gitignorePath, 'utf-8');
-
-        if (!content.includes(logFileName)) {
-          const newContent = content.trim() + '\n\n# Claude GWT log file\n' + logFileName + '\n';
-          fs.writeFileSync(gitignorePath, newContent);
-        }
-      }
-    } catch (_error) {
-      // Silently ignore errors
-    }
-  }
+  private ensureGitIgnore(): void {}
 
   // Context binding (like structlog)
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/core/utils/logger.ts:111:25
 
   private ensureGitIgnore(): void {
     const gitignorePath = path.join(process.cwd(), '.gitignore');
-    const logFileName = '.claude-gwt.log';
+    const logFileName = "";
 
     try {
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/core/utils/logger.ts:113:9
     const gitignorePath = path.join(process.cwd(), '.gitignore');
     const logFileName = '.claude-gwt.log';
 
-    try {
-      if (fs.existsSync(gitignorePath)) {
-        const content = fs.readFileSync(gitignorePath, 'utf-8');
-
-        if (!content.includes(logFileName)) {
-          const newContent = content.trim() + '\n\n# Claude GWT log file\n' + logFileName + '\n';
-          fs.writeFileSync(gitignorePath, newContent);
-        }
-      }
-    } catch (_error) {
+    try {} catch (_error) {
       // Silently ignore errors
     }
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/core/utils/logger.ts:114:11
     const logFileName = '.claude-gwt.log';
 
     try {
-      if (fs.existsSync(gitignorePath)) {
+      if (false) {
         const content = fs.readFileSync(gitignorePath, 'utf-8');
 
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/core/utils/logger.ts:114:41
     const logFileName = '.claude-gwt.log';
 
     try {
-      if (fs.existsSync(gitignorePath)) {
-        const content = fs.readFileSync(gitignorePath, 'utf-8');
-
-        if (!content.includes(logFileName)) {
-          const newContent = content.trim() + '\n\n# Claude GWT log file\n' + logFileName + '\n';
-          fs.writeFileSync(gitignorePath, newContent);
-        }
-      }
+      if (fs.existsSync(gitignorePath)) {}
     } catch (_error) {
       // Silently ignore errors
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/core/utils/logger.ts:117:13
       if (fs.existsSync(gitignorePath)) {
         const content = fs.readFileSync(gitignorePath, 'utf-8');
 
-        if (!content.includes(logFileName)) {
+        if (false) {
           const newContent = content.trim() + '\n\n# Claude GWT log file\n' + logFileName + '\n';
           fs.writeFileSync(gitignorePath, newContent);
killedBy: Error handling in ensureGitIgnore should add .claude-gwt.log to gitignore when not present
statusReason: expected "writeFileSync" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/core/utils/logger.ts:117:13
       if (fs.existsSync(gitignorePath)) {
         const content = fs.readFileSync(gitignorePath, 'utf-8');
 
-        if (!content.includes(logFileName)) {
+        if (true) {
           const newContent = content.trim() + '\n\n# Claude GWT log file\n' + logFileName + '\n';
           fs.writeFileSync(gitignorePath, newContent);
killedBy: Error handling in ensureGitIgnore should not modify gitignore when .claude-gwt.log already exists
statusReason: expected "writeFileSync" to not be called at all, but actually been called 1 times

Received: 

  1st writeFileSync call:

    Array [
      "/home/nazq/dev/claude_gwt/.stryker-tmp/sandbox-Ik4BdR/.gitignore",

[Survived] MethodExpression
src/core/utils/logger.ts:118:30
         const content = fs.readFileSync(gitignorePath, 'utf-8');
 
         if (!content.includes(logFileName)) {
-          const newContent = content.trim() + '\n\n# Claude GWT log file\n' + logFileName + '\n';
+          const newContent = content + '\n\n# Claude GWT log file\n' + logFileName + '\n';
           fs.writeFileSync(gitignorePath, newContent);
         }

[Survived] BlockStatement
src/core/utils/logger.ts:150:65
   }
 
   // Structured logging methods with beautiful formatting
-  info(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.info({ ...this.context, ...fields }, message);
-  }
+  info(message: string, fields?: Record<string, unknown>): void {}
 
   error(message: string, error?: unknown, fields?: Record<string, unknown>): void {

[Survived] BlockStatement
src/core/utils/logger.ts:154:83
     this.baseLogger.info({ ...this.context, ...fields }, message);
   }
 
-  error(message: string, error?: unknown, fields?: Record<string, unknown>): void {
-    const errorData =
-      error instanceof Error
-        ? { err: error } // Pino has special handling for 'err' field
-        : { error };
-
-    this.baseLogger.error({ ...this.context, ...errorData, ...fields }, message);
-  }
+  error(message: string, error?: unknown, fields?: Record<string, unknown>): void {}
 
   debug(message: string, fields?: Record<string, unknown>): void {

[Survived] ObjectLiteral
src/core/utils/logger.ts:157:11
   error(message: string, error?: unknown, fields?: Record<string, unknown>): void {
     const errorData =
       error instanceof Error
-        ? { err: error } // Pino has special handling for 'err' field
+        ? {} // Pino has special handling for 'err' field
         : { error };
 

[Survived] ObjectLiteral
src/core/utils/logger.ts:158:11
     const errorData =
       error instanceof Error
         ? { err: error } // Pino has special handling for 'err' field
-        : { error };
+        : {};
 
     this.baseLogger.error({ ...this.context, ...errorData, ...fields }, message);

[Survived] BlockStatement
src/core/utils/logger.ts:163:66
     this.baseLogger.error({ ...this.context, ...errorData, ...fields }, message);
   }
 
-  debug(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.debug({ ...this.context, ...fields }, message);
-  }
+  debug(message: string, fields?: Record<string, unknown>): void {}
 
   warn(message: string, fields?: Record<string, unknown>): void {

[Survived] BlockStatement
src/core/utils/logger.ts:167:65
     this.baseLogger.debug({ ...this.context, ...fields }, message);
   }
 
-  warn(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.warn({ ...this.context, ...fields }, message);
-  }
+  warn(message: string, fields?: Record<string, unknown>): void {}
 
   fatal(message: string, fields?: Record<string, unknown>): void {

[Survived] BlockStatement
src/core/utils/logger.ts:171:66
     this.baseLogger.warn({ ...this.context, ...fields }, message);
   }
 
-  fatal(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.fatal({ ...this.context, ...fields }, message);
-  }
+  fatal(message: string, fields?: Record<string, unknown>): void {}
 
   trace(message: string, fields?: Record<string, unknown>): void {

[Survived] BlockStatement
src/core/utils/logger.ts:175:66
     this.baseLogger.fatal({ ...this.context, ...fields }, message);
   }
 
-  trace(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.trace({ ...this.context, ...fields }, message);
-  }
+  trace(message: string, fields?: Record<string, unknown>): void {}
 
   // Enhanced logging methods with emojis for development

[Survived] BlockStatement
src/core/utils/logger.ts:180:68
   }
 
   // Enhanced logging methods with emojis for development
-  success(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.info({ ...this.context, ...fields, logType: 'success' }, `✅ ${message}`);
-  }
+  success(message: string, fields?: Record<string, unknown>): void {}
 
   failure(message: string, error?: unknown, fields?: Record<string, unknown>): void {

[Survived] ObjectLiteral
src/core/utils/logger.ts:181:26
 
   // Enhanced logging methods with emojis for development
   success(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.info({ ...this.context, ...fields, logType: 'success' }, `✅ ${message}`);
+    this.baseLogger.info({}, `✅ ${message}`);
   }
 

[Survived] BlockStatement
src/core/utils/logger.ts:184:85
     this.baseLogger.info({ ...this.context, ...fields, logType: 'success' }, `✅ ${message}`);
   }
 
-  failure(message: string, error?: unknown, fields?: Record<string, unknown>): void {
-    const errorData = error instanceof Error ? { err: error } : { error };
-
-    this.baseLogger.error(
-      { ...this.context, ...errorData, ...fields, logType: 'failure' },
-      `❌ ${message}`,
-    );
-  }
+  failure(message: string, error?: unknown, fields?: Record<string, unknown>): void {}
 
   progress(message: string, fields?: Record<string, unknown>): void {

[Survived] ObjectLiteral
src/core/utils/logger.ts:185:48
   }
 
   failure(message: string, error?: unknown, fields?: Record<string, unknown>): void {
-    const errorData = error instanceof Error ? { err: error } : { error };
+    const errorData = error instanceof Error ? {} : { error };
 
     this.baseLogger.error(

[Survived] StringLiteral
src/core/utils/logger.ts:188:60
     const errorData = error instanceof Error ? { err: error } : { error };
 
     this.baseLogger.error(
-      { ...this.context, ...errorData, ...fields, logType: 'failure' },
+      { ...this.context, ...errorData, ...fields, logType: "" },
       `❌ ${message}`,
     );

[Survived] StringLiteral
src/core/utils/logger.ts:189:7
 
     this.baseLogger.error(
       { ...this.context, ...errorData, ...fields, logType: 'failure' },
-      `❌ ${message}`,
+      ``,
     );
   }

[Survived] BlockStatement
src/core/utils/logger.ts:193:69
     );
   }
 
-  progress(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.info({ ...this.context, ...fields, logType: 'progress' }, `🔄 ${message}`);
-  }
+  progress(message: string, fields?: Record<string, unknown>): void {}
 
   milestone(message: string, fields?: Record<string, unknown>): void {

[Survived] StringLiteral
src/core/utils/logger.ts:194:79
   }
 
   progress(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.info({ ...this.context, ...fields, logType: 'progress' }, `🔄 ${message}`);
+    this.baseLogger.info({ ...this.context, ...fields, logType: 'progress' }, ``;
   }
 

[Survived] ObjectLiteral
src/core/utils/logger.ts:194:26
   }
 
   progress(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.info({ ...this.context, ...fields, logType: 'progress' }, `🔄 ${message}`);
+    this.baseLogger.info({}, `🔄 ${message}`);
   }
 

[Survived] BlockStatement
src/core/utils/logger.ts:197:70
     this.baseLogger.info({ ...this.context, ...fields, logType: 'progress' }, `🔄 ${message}`);
   }
 
-  milestone(message: string, fields?: Record<string, unknown>): void {
-    this.baseLogger.info({ ...this.context, ...fields, logType: 'milestone' }, `🎉 ${message}`);
-  }
+  milestone(message: string, fields?: Record<string, unknown>): void {}
 
   // Timing operations (performance logging)

[Survived] BlockStatement
src/core/utils/logger.ts:204:24
   // Timing operations (performance logging)
   time(label: string): () => void {
     const start = Date.now();
-    return (): void => {
-      const duration = Date.now() - start;
-      this.debug('Operation completed', { operation: label, duration });
-    };
+    return (): void => {};
   }
 

[Survived] ArithmeticOperator
src/core/utils/logger.ts:205:24
   time(label: string): () => void {
     const start = Date.now();
     return (): void => {
-      const duration = Date.now() - start;
+      const duration = Date.now() + start;
       this.debug('Operation completed', { operation: label, duration });
     };

[Survived] StringLiteral
src/core/utils/logger.ts:206:18
     const start = Date.now();
     return (): void => {
       const duration = Date.now() - start;
-      this.debug('Operation completed', { operation: label, duration });
+      this.debug("", { operation: label, duration });
     };
   }

[Survived] ObjectLiteral
src/core/utils/logger.ts:212:22
 
   // Git operation context
   forGitOperation(operation: string, branch?: string): StructuredLogger {
-    return this.bind({ operation, branchName: branch });
+    return this.bind({});
   }
 

[Survived] ObjectLiteral
src/core/utils/logger.ts:217:22
 
   // Worktree context
   forWorktree(path: string, branch: string): StructuredLogger {
-    return this.bind({ worktreePath: path, branchName: branch });
+    return this.bind({});
   }
 

[Survived] ObjectLiteral
src/core/utils/logger.ts:227:22
 
   // Network operation context
   forNetworkOperation(operation: string, url: string): StructuredLogger {
-    return this.bind({ operation, url, type: 'network' });
+    return this.bind({});
   }
 

[Survived] BlockStatement
src/core/utils/logger.ts:231:68
   }
 
   // Verbose logging (mapped to trace)
-  verbose(message: string, fields?: Record<string, unknown>): void {
-    this.trace(message, fields);
-  }
+  verbose(message: string, fields?: Record<string, unknown>): void {}
 
   // Level checking

[Killed] BlockStatement
src/core/utils/logger.ts:242:37
 
   // Cleanup
   flush(): Promise<void> {
-    return new Promise((resolve) => {
-      this.baseLogger.flush();
-      resolve();
-    });
+    return new Promise((resolve) => {});
   }
 }
killedBy: StructuredLogger (Pino) flush operations should call flush without error
statusReason: Test timed out in 20000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/core/utils/logger.ts:263:9
 let _defaultLogger: StructuredLogger | null = null;
 export const logger = {
   get instance(): StructuredLogger {
-    if (!_defaultLogger) {
+    if (true) {
       _defaultLogger = createLogger({ name: 'claude-gwt' });
     }
killedBy: Logger singleton lazy initialization should lazily initialize the default logger instance
statusReason: expected StructuredLogger{ …(2) } to be StructuredLogger{ …(2) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: StructuredLogger{ …(2) }
Received: serializes to the same string
