[Survived] StringLiteral
src/core/utils/logger.ts:264:45
 export const logger = {
   get instance(): StructuredLogger {
     if (!_defaultLogger) {
-      _defaultLogger = createLogger({ name: 'claude-gwt' });
+      _defaultLogger = createLogger({ name: "" });
     }
     return _defaultLogger;

[Survived] ObjectLiteral
src/core/utils/logger.ts:264:37
 export const logger = {
   get instance(): StructuredLogger {
     if (!_defaultLogger) {
-      _defaultLogger = createLogger({ name: 'claude-gwt' });
+      _defaultLogger = createLogger({});
     }
     return _defaultLogger;

[Survived] ArrowFunction
src/core/utils/logger.ts:277:10
     logger.instance.debug(message, fields),
   warn: (message: string, fields?: Record<string, unknown>): void =>
     logger.instance.warn(message, fields),
-  fatal: (message: string, fields?: Record<string, unknown>): void =>
-    logger.instance.fatal(message, fields),
+  fatal: () => undefined,
   trace: (message: string, fields?: Record<string, unknown>): void =>
     logger.instance.trace(message, fields),

[Killed] ArrowFunction
src/core/utils/logger.ts:289:9
     logger.instance.progress(message, fields),
   milestone: (message: string, fields?: Record<string, unknown>): void =>
     logger.instance.milestone(message, fields),
-  time: (label: string): (() => void) => logger.instance.time(label),
+  time: () => undefined,
   forGitOperation: (operation: string, branch?: string): StructuredLogger =>
     logger.instance.forGitOperation(operation, branch),
killedBy: Legacy console logger implementation logger singleton should delegate utility methods correctly
statusReason: expected undefined to be an instance of Function

[Killed] ArrowFunction
src/core/utils/logger.ts:290:20
   milestone: (message: string, fields?: Record<string, unknown>): void =>
     logger.instance.milestone(message, fields),
   time: (label: string): (() => void) => logger.instance.time(label),
-  forGitOperation: (operation: string, branch?: string): StructuredLogger =>
-    logger.instance.forGitOperation(operation, branch),
+  forGitOperation: () => undefined,
   forWorktree: (path: string, branch: string): StructuredLogger =>
     logger.instance.forWorktree(path, branch),
killedBy: Legacy console logger implementation logger singleton should delegate context methods correctly
statusReason: expected undefined to be an instance of StructuredLogger

[Killed] ArrowFunction
src/core/utils/logger.ts:292:16
   time: (label: string): (() => void) => logger.instance.time(label),
   forGitOperation: (operation: string, branch?: string): StructuredLogger =>
     logger.instance.forGitOperation(operation, branch),
-  forWorktree: (path: string, branch: string): StructuredLogger =>
-    logger.instance.forWorktree(path, branch),
+  forWorktree: () => undefined,
   forSession: (sessionId: string): StructuredLogger => logger.instance.forSession(sessionId),
   forNetworkOperation: (operation: string, url: string): StructuredLogger =>
killedBy: Legacy console logger implementation logger singleton should delegate context methods correctly
statusReason: expected undefined to be an instance of StructuredLogger

[Killed] ArrowFunction
src/core/utils/logger.ts:294:15
     logger.instance.forGitOperation(operation, branch),
   forWorktree: (path: string, branch: string): StructuredLogger =>
     logger.instance.forWorktree(path, branch),
-  forSession: (sessionId: string): StructuredLogger => logger.instance.forSession(sessionId),
+  forSession: () => undefined,
   forNetworkOperation: (operation: string, url: string): StructuredLogger =>
     logger.instance.forNetworkOperation(operation, url),
killedBy: Legacy console logger implementation logger singleton should delegate context methods correctly
statusReason: expected undefined to be an instance of StructuredLogger

[Killed] ArrowFunction
src/core/utils/logger.ts:295:24
   forWorktree: (path: string, branch: string): StructuredLogger =>
     logger.instance.forWorktree(path, branch),
   forSession: (sessionId: string): StructuredLogger => logger.instance.forSession(sessionId),
-  forNetworkOperation: (operation: string, url: string): StructuredLogger =>
-    logger.instance.forNetworkOperation(operation, url),
+  forNetworkOperation: () => undefined,
   verbose: (message: string, fields?: Record<string, unknown>): void =>
     logger.instance.verbose(message, fields),
killedBy: Legacy console logger implementation logger singleton should delegate context methods correctly
statusReason: expected undefined to be an instance of StructuredLogger

[Survived] ArrowFunction
src/core/utils/logger.ts:297:12
   forSession: (sessionId: string): StructuredLogger => logger.instance.forSession(sessionId),
   forNetworkOperation: (operation: string, url: string): StructuredLogger =>
     logger.instance.forNetworkOperation(operation, url),
-  verbose: (message: string, fields?: Record<string, unknown>): void =>
-    logger.instance.verbose(message, fields),
+  verbose: () => undefined,
   isLevelEnabled: (level: LogLevel): boolean => logger.instance.isLevelEnabled(level),
   flush: (): Promise<void> => logger.instance.flush(),

[Killed] ArrowFunction
src/core/utils/logger.ts:299:19
     logger.instance.forNetworkOperation(operation, url),
   verbose: (message: string, fields?: Record<string, unknown>): void =>
     logger.instance.verbose(message, fields),
-  isLevelEnabled: (level: LogLevel): boolean => logger.instance.isLevelEnabled(level),
+  isLevelEnabled: () => undefined,
   flush: (): Promise<void> => logger.instance.flush(),
   bind: (context: LogContext): StructuredLogger => logger.instance.bind(context),
killedBy: Legacy console logger implementation logger singleton should delegate utility methods correctly
statusReason: expected undefined to be false // Object.is equality

[Killed] ArrowFunction
src/core/utils/logger.ts:300:10
   verbose: (message: string, fields?: Record<string, unknown>): void =>
     logger.instance.verbose(message, fields),
   isLevelEnabled: (level: LogLevel): boolean => logger.instance.isLevelEnabled(level),
-  flush: (): Promise<void> => logger.instance.flush(),
+  flush: () => undefined,
   bind: (context: LogContext): StructuredLogger => logger.instance.bind(context),
   child: (bindings: LogContext): StructuredLogger => logger.instance.child(bindings),
killedBy: Legacy console logger implementation logger singleton should handle flush correctly
statusReason: You must provide a Promise to expect() when using .resolves, not 'undefined'.

[Killed] ArrowFunction
src/core/utils/logger.ts:301:9
     logger.instance.verbose(message, fields),
   isLevelEnabled: (level: LogLevel): boolean => logger.instance.isLevelEnabled(level),
   flush: (): Promise<void> => logger.instance.flush(),
-  bind: (context: LogContext): StructuredLogger => logger.instance.bind(context),
+  bind: () => undefined,
   child: (bindings: LogContext): StructuredLogger => logger.instance.child(bindings),
 };
killedBy: Legacy console logger implementation logger singleton should delegate utility methods correctly
statusReason: expected undefined to be an instance of StructuredLogger

[Killed] ArrowFunction
src/core/utils/logger.ts:302:10
   isLevelEnabled: (level: LogLevel): boolean => logger.instance.isLevelEnabled(level),
   flush: (): Promise<void> => logger.instance.flush(),
   bind: (context: LogContext): StructuredLogger => logger.instance.bind(context),
-  child: (bindings: LogContext): StructuredLogger => logger.instance.child(bindings),
+  child: () => undefined,
 };
 
killedBy: Legacy console logger implementation logger singleton should delegate utility methods correctly
statusReason: expected undefined to be an instance of StructuredLogger

[Survived] ArrowFunction
src/core/utils/logger.ts:317:12
   verbose: (message: string, data?: unknown): void =>
     logger.trace(message, data as Record<string, unknown>), // Map verbose to trace
   // Enhanced methods for beautiful logging
-  success: (message: string, data?: unknown): void =>
-    logger.success(message, data as Record<string, unknown>),
+  success: () => undefined,
   failure: (message: string, error?: unknown, data?: unknown): void =>
     logger.failure(message, error, data as Record<string, unknown>),

[Survived] ArrowFunction
src/core/utils/logger.ts:319:12
   // Enhanced methods for beautiful logging
   success: (message: string, data?: unknown): void =>
     logger.success(message, data as Record<string, unknown>),
-  failure: (message: string, error?: unknown, data?: unknown): void =>
-    logger.failure(message, error, data as Record<string, unknown>),
+  failure: () => undefined,
   progress: (message: string, data?: unknown): void =>
     logger.progress(message, data as Record<string, unknown>),

[Survived] ArrowFunction
src/core/utils/logger.ts:321:13
     logger.success(message, data as Record<string, unknown>),
   failure: (message: string, error?: unknown, data?: unknown): void =>
     logger.failure(message, error, data as Record<string, unknown>),
-  progress: (message: string, data?: unknown): void =>
-    logger.progress(message, data as Record<string, unknown>),
+  progress: () => undefined,
   milestone: (message: string, data?: unknown): void =>
     logger.milestone(message, data as Record<string, unknown>),

[Survived] ArrowFunction
src/core/utils/logger.ts:323:14
     logger.failure(message, error, data as Record<string, unknown>),
   progress: (message: string, data?: unknown): void =>
     logger.progress(message, data as Record<string, unknown>),
-  milestone: (message: string, data?: unknown): void =>
-    logger.milestone(message, data as Record<string, unknown>),
+  milestone: () => undefined,
   setLogLevel: (_level: LogLevel): void => {
     // Note: Pino doesn't support runtime level changes on the same instance

[Killed] BlockStatement
src/core/utils/logger.ts:325:44
     logger.progress(message, data as Record<string, unknown>),
   milestone: (message: string, data?: unknown): void =>
     logger.milestone(message, data as Record<string, unknown>),
-  setLogLevel: (_level: LogLevel): void => {
-    // Note: Pino doesn't support runtime level changes on the same instance
-    // This is a limitation we'll document
-    logger.warn('setLogLevel not supported in Pino - create new logger instance');
-  },
+  setLogLevel: (_level: LogLevel): void => {},
   getLogPath: (): string => path.join(process.cwd(), '.claude-gwt.log'),
   close: async (): Promise<void> => logger.flush(),
killedBy: Logger setLogLevel should warn about setLogLevel not being supported
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ArrowFunction
src/core/utils/logger.ts:330:15
     // This is a limitation we'll document
     logger.warn('setLogLevel not supported in Pino - create new logger instance');
   },
-  getLogPath: (): string => path.join(process.cwd(), '.claude-gwt.log'),
+  getLogPath: () => undefined,
   close: async (): Promise<void> => logger.flush(),
 };
killedBy: Logger setLogLevel should handle getLogPath
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrowFunction
src/core/utils/logger.ts:331:10
     logger.warn('setLogLevel not supported in Pino - create new logger instance');
   },
   getLogPath: (): string => path.join(process.cwd(), '.claude-gwt.log'),
-  close: async (): Promise<void> => logger.flush(),
+  close: () => undefined,
 };
 
killedBy: Logger setLogLevel should handle close method
statusReason: expected "spy" to be called at least once
