[Killed] EqualityOperator
src/core/utils/type-guards.ts:12:17
  * Check if a value is a valid DirectoryState
  */
 export function isDirectoryState(value: unknown): value is DirectoryState {
-  if (!value || typeof value !== 'object') {
+  if (!value || typeof value === 'object') {
     return false;
   }
killedBy: Type Guards isDirectoryState should return true for valid DirectoryState objects
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/utils/type-guards.ts:12:7
  * Check if a value is a valid DirectoryState
  */
 export function isDirectoryState(value: unknown): value is DirectoryState {
-  if (!value || typeof value !== 'object') {
+  if (!value && typeof value !== 'object') {
     return false;
   }
killedBy: Type Guards isDirectoryState should return false for invalid objects
statusReason: Cannot read properties of null (reading 'type')

[Killed] BooleanLiteral
src/core/utils/type-guards.ts:13:12
  */
 export function isDirectoryState(value: unknown): value is DirectoryState {
   if (!value || typeof value !== 'object') {
-    return false;
+    return true;
   }
 
killedBy: Type Guards isDirectoryState should return false for invalid objects
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:20:5
   const validTypes = ['empty', 'claude-gwt-parent', 'git-worktree', 'git-repo', 'non-git'];
 
   return (
-    typeof state['type'] === 'string' &&
-    validTypes.includes(state['type']) &&
-    typeof state['path'] === 'string'
+    true
   );
 }
killedBy: Type Guards isDirectoryState should return false for invalid objects
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:20:5
   const validTypes = ['empty', 'claude-gwt-parent', 'git-worktree', 'git-repo', 'non-git'];
 
   return (
-    typeof state['type'] === 'string' &&
-    validTypes.includes(state['type']) &&
+    true &&
     typeof state['path'] === 'string'
   );
killedBy: Type Guards isDirectoryState should return false for invalid objects
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:22:5
   return (
     typeof state['type'] === 'string' &&
     validTypes.includes(state['type']) &&
-    typeof state['path'] === 'string'
+    typeof state['path'] !== 'string'
   );
 }
killedBy: Type Guards isDirectoryState should return true for valid DirectoryState objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:22:5
   return (
     typeof state['type'] === 'string' &&
     validTypes.includes(state['type']) &&
-    typeof state['path'] === 'string'
+    true
   );
 }
killedBy: Type Guards isDirectoryState should return false for invalid objects
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/utils/type-guards.ts:30:44
  * Check if a value is a valid SessionInfo
  */
 export function isSessionInfo(value: unknown): value is SessionInfo {
-  if (!value || typeof value !== 'object') {
-    return false;
-  }
+  if (!value || typeof value !== 'object') {}
 
   const info = value as Record<string, unknown>;
killedBy: Type Guards isSessionInfo should return false for invalid objects
statusReason: Cannot read properties of null (reading 'name')

[Killed] EqualityOperator
src/core/utils/type-guards.ts:30:17
  * Check if a value is a valid SessionInfo
  */
 export function isSessionInfo(value: unknown): value is SessionInfo {
-  if (!value || typeof value !== 'object') {
+  if (!value || typeof value === 'object') {
     return false;
   }
killedBy: Type Guards isSessionInfo should return true for valid SessionInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/utils/type-guards.ts:37:5
   const info = value as Record<string, unknown>;
 
   return (
-    typeof info['name'] === 'string' &&
-    typeof info['windows'] === 'number' &&
-    typeof info['created'] === 'string' &&
-    typeof info['attached'] === 'boolean' &&
+    typeof info['name'] === 'string' && typeof info['windows'] === 'number' && typeof info['created'] === 'string' || typeof info['attached'] === 'boolean' &&
     typeof info['hasClaudeRunning'] === 'boolean'
   );
killedBy: Type Guards isSessionInfo should return false for invalid objects
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:37:5
   const info = value as Record<string, unknown>;
 
   return (
-    typeof info['name'] === 'string' &&
+    typeof info['name'] !== 'string' &&
     typeof info['windows'] === 'number' &&
     typeof info['created'] === 'string' &&
killedBy: Type Guards isSessionInfo should return true for valid SessionInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:38:5
 
   return (
     typeof info['name'] === 'string' &&
-    typeof info['windows'] === 'number' &&
+    typeof info['windows'] !== 'number' &&
     typeof info['created'] === 'string' &&
     typeof info['attached'] === 'boolean' &&
killedBy: Type Guards isSessionInfo should return true for valid SessionInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:38:5
 
   return (
     typeof info['name'] === 'string' &&
-    typeof info['windows'] === 'number' &&
+    true &&
     typeof info['created'] === 'string' &&
     typeof info['attached'] === 'boolean' &&
killedBy: Type Guards isSessionInfo should return false for invalid objects
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:39:5
   return (
     typeof info['name'] === 'string' &&
     typeof info['windows'] === 'number' &&
-    typeof info['created'] === 'string' &&
+    typeof info['created'] !== 'string' &&
     typeof info['attached'] === 'boolean' &&
     typeof info['hasClaudeRunning'] === 'boolean'
killedBy: Type Guards isSessionInfo should return true for valid SessionInfo objects
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/core/utils/type-guards.ts:39:5
   return (
     typeof info['name'] === 'string' &&
     typeof info['windows'] === 'number' &&
-    typeof info['created'] === 'string' &&
+    true &&
     typeof info['attached'] === 'boolean' &&
     typeof info['hasClaudeRunning'] === 'boolean'

[Killed] EqualityOperator
src/core/utils/type-guards.ts:40:5
     typeof info['name'] === 'string' &&
     typeof info['windows'] === 'number' &&
     typeof info['created'] === 'string' &&
-    typeof info['attached'] === 'boolean' &&
+    typeof info['attached'] !== 'boolean' &&
     typeof info['hasClaudeRunning'] === 'boolean'
   );
killedBy: Type Guards isSessionInfo should return true for valid SessionInfo objects
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/core/utils/type-guards.ts:40:5
     typeof info['name'] === 'string' &&
     typeof info['windows'] === 'number' &&
     typeof info['created'] === 'string' &&
-    typeof info['attached'] === 'boolean' &&
+    true &&
     typeof info['hasClaudeRunning'] === 'boolean'
   );

[Killed] EqualityOperator
src/core/utils/type-guards.ts:41:5
     typeof info['windows'] === 'number' &&
     typeof info['created'] === 'string' &&
     typeof info['attached'] === 'boolean' &&
-    typeof info['hasClaudeRunning'] === 'boolean'
+    typeof info['hasClaudeRunning'] !== 'boolean'
   );
 }
killedBy: Type Guards isSessionInfo should return true for valid SessionInfo objects
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/core/utils/type-guards.ts:41:5
     typeof info['windows'] === 'number' &&
     typeof info['created'] === 'string' &&
     typeof info['attached'] === 'boolean' &&
-    typeof info['hasClaudeRunning'] === 'boolean'
+    true
   );
 }

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:49:7
  * Check if a value is a valid GitWorktreeInfo
  */
 export function isGitWorktreeInfo(value: unknown): value is GitWorktreeInfo {
-  if (!value || typeof value !== 'object') {
+  if (false) {
     return false;
   }
killedBy: Type Guards isGitWorktreeInfo should return false for invalid objects
statusReason: Cannot read properties of null (reading 'path')

[Killed] LogicalOperator
src/core/utils/type-guards.ts:49:7
  * Check if a value is a valid GitWorktreeInfo
  */
 export function isGitWorktreeInfo(value: unknown): value is GitWorktreeInfo {
-  if (!value || typeof value !== 'object') {
+  if (!value && typeof value !== 'object') {
     return false;
   }
killedBy: Type Guards isGitWorktreeInfo should return false for invalid objects
statusReason: Cannot read properties of null (reading 'path')

[Killed] LogicalOperator
src/core/utils/type-guards.ts:56:5
   const info = value as Record<string, unknown>;
 
   return (
-    typeof info['path'] === 'string' &&
-    typeof info['branch'] === 'string' &&
-    (info['commit'] === undefined || typeof info['commit'] === 'string') &&
+    typeof info['path'] === 'string' && typeof info['branch'] === 'string' || info['commit'] === undefined || typeof info['commit'] === 'string' &&
     (info['locked'] === undefined || typeof info['locked'] === 'boolean')
   );
killedBy: Type Guards isGitWorktreeInfo should return false for invalid objects
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:56:5
   const info = value as Record<string, unknown>;
 
   return (
-    typeof info['path'] === 'string' &&
-    typeof info['branch'] === 'string' &&
-    (info['commit'] === undefined || typeof info['commit'] === 'string') &&
-    (info['locked'] === undefined || typeof info['locked'] === 'boolean')
+    false
   );
 }
killedBy: Type Guards isGitWorktreeInfo should return true for valid GitWorktreeInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:57:5
 
   return (
     typeof info['path'] === 'string' &&
-    typeof info['branch'] === 'string' &&
+    true &&
     (info['commit'] === undefined || typeof info['commit'] === 'string') &&
     (info['locked'] === undefined || typeof info['locked'] === 'boolean')
killedBy: Type Guards isGitWorktreeInfo should return false for invalid objects
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:57:5
 
   return (
     typeof info['path'] === 'string' &&
-    typeof info['branch'] === 'string' &&
+    typeof info['branch'] !== 'string' &&
     (info['commit'] === undefined || typeof info['commit'] === 'string') &&
     (info['locked'] === undefined || typeof info['locked'] === 'boolean')
killedBy: Type Guards isGitWorktreeInfo should return true for valid GitWorktreeInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:58:38
   return (
     typeof info['path'] === 'string' &&
     typeof info['branch'] === 'string' &&
-    (info['commit'] === undefined || typeof info['commit'] === 'string') &&
+    (info['commit'] === undefined || typeof info['commit'] !== 'string') &&
     (info['locked'] === undefined || typeof info['locked'] === 'boolean')
   );
killedBy: Type Guards isGitWorktreeInfo should return true for valid GitWorktreeInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/utils/type-guards.ts:58:6
   return (
     typeof info['path'] === 'string' &&
     typeof info['branch'] === 'string' &&
-    (info['commit'] === undefined || typeof info['commit'] === 'string') &&
+    (info['commit'] === undefined && typeof info['commit'] === 'string') &&
     (info['locked'] === undefined || typeof info['locked'] === 'boolean')
   );
killedBy: Type Guards isGitWorktreeInfo should return true for valid GitWorktreeInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:59:6
     typeof info['path'] === 'string' &&
     typeof info['branch'] === 'string' &&
     (info['commit'] === undefined || typeof info['commit'] === 'string') &&
-    (info['locked'] === undefined || typeof info['locked'] === 'boolean')
+    (info['locked'] !== undefined || typeof info['locked'] === 'boolean')
   );
 }
killedBy: Type Guards isGitWorktreeInfo should return true for valid GitWorktreeInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:59:38
     typeof info['path'] === 'string' &&
     typeof info['branch'] === 'string' &&
     (info['commit'] === undefined || typeof info['commit'] === 'string') &&
-    (info['locked'] === undefined || typeof info['locked'] === 'boolean')
+    (info['locked'] === undefined || typeof info['locked'] !== 'boolean')
   );
 }
killedBy: Type Guards isGitWorktreeInfo should return true for valid GitWorktreeInfo objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:68:5
  */
 export function isErrorLike(value: unknown): value is Error {
   return (
-    value instanceof Error ||
-    (value !== null &&
-      typeof value === 'object' &&
-      'message' in value &&
-      typeof (value as Record<string, unknown>)['message'] === 'string')
+    false
   );
 }
killedBy: Type Guards isErrorLike should return true for Error instances
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:68:5
  */
 export function isErrorLike(value: unknown): value is Error {
   return (
-    value instanceof Error ||
-    (value !== null &&
-      typeof value === 'object' &&
-      'message' in value &&
-      typeof (value as Record<string, unknown>)['message'] === 'string')
+    true
   );
 }
killedBy: Type Guards isErrorLike should return false for non-error objects
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:69:6
 export function isErrorLike(value: unknown): value is Error {
   return (
     value instanceof Error ||
-    (value !== null &&
-      typeof value === 'object' &&
-      'message' in value &&
-      typeof (value as Record<string, unknown>)['message'] === 'string')
+    (false)
   );
 }
killedBy: Type Guards isErrorLike should return true for Error-like objects
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/utils/type-guards.ts:69:6
 export function isErrorLike(value: unknown): value is Error {
   return (
     value instanceof Error ||
-    (value !== null &&
-      typeof value === 'object' &&
-      'message' in value &&
-      typeof (value as Record<string, unknown>)['message'] === 'string')
+    (value !== null && typeof value === 'object' && 'message' in value || typeof (value as Record<string, unknown>)['message'] === 'string')
   );
 }
killedBy: Type Guards isErrorLike should return false for non-error objects
statusReason: Cannot read properties of null (reading 'message')

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:72:7
     (value !== null &&
       typeof value === 'object' &&
       'message' in value &&
-      typeof (value as Record<string, unknown>)['message'] === 'string')
+      true)
   );
 }
killedBy: Type Guards isErrorLike should return false for non-error objects
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:72:7
     (value !== null &&
       typeof value === 'object' &&
       'message' in value &&
-      typeof (value as Record<string, unknown>)['message'] === 'string')
+      typeof (value as Record<string, unknown>)['message'] !== 'string')
   );
 }
killedBy: Type Guards isErrorLike should return true for Error-like objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:81:5
  */
 export function isErrnoException(value: unknown): value is NodeJS.ErrnoException {
   return (
-    isErrorLike(value) &&
-    ('code' in value || 'errno' in value || 'syscall' in value || 'path' in value)
+    true
   );
 }
killedBy: Type Guards isErrnoException should return false for regular errors
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:81:5
  */
 export function isErrnoException(value: unknown): value is NodeJS.ErrnoException {
   return (
-    isErrorLike(value) &&
-    ('code' in value || 'errno' in value || 'syscall' in value || 'path' in value)
+    false
   );
 }
killedBy: Type Guards isErrnoException should return true for NodeJS.ErrnoException
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/utils/type-guards.ts:82:6
 export function isErrnoException(value: unknown): value is NodeJS.ErrnoException {
   return (
     isErrorLike(value) &&
-    ('code' in value || 'errno' in value || 'syscall' in value || 'path' in value)
+    (('code' in value || 'errno' in value) && 'syscall' in value || 'path' in value)
   );
 }
killedBy: Type Guards isErrnoException should return true for NodeJS.ErrnoException
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/utils/type-guards.ts:82:6
 export function isErrnoException(value: unknown): value is NodeJS.ErrnoException {
   return (
     isErrorLike(value) &&
-    ('code' in value || 'errno' in value || 'syscall' in value || 'path' in value)
+    ('code' in value && 'errno' in value || 'syscall' in value || 'path' in value)
   );
 }
killedBy: Type Guards isErrnoException should return true for NodeJS.ErrnoException
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:90:56
  * Type guard for array of strings
  */
 export function isStringArray(value: unknown): value is string[] {
-  return Array.isArray(value) && value.every((item) => typeof item === 'string');
+  return Array.isArray(value) && value.every((item) => true);
 }
 
killedBy: Type Guards isStringArray should return false for non-string arrays
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/core/utils/type-guards.ts:90:34
  * Type guard for array of strings
  */
 export function isStringArray(value: unknown): value is string[] {
-  return Array.isArray(value) && value.every((item) => typeof item === 'string');
+  return Array.isArray(value) && value.some(item => typeof item === 'string');
 }
 
killedBy: Type Guards isStringArray should return true for arrays of strings
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:97:10
  * Type guard for non-empty string
  */
 export function isNonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.length > 0;
+  return true;
 }
 
killedBy: Type Guards isNonEmptyString should return false for empty strings and non-strings
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/utils/type-guards.ts:104:39
  * Type guard for positive number
  */
 export function isPositiveNumber(value: unknown): value is number {
-  return typeof value === 'number' && value > 0 && Number.isFinite(value);
+  return typeof value === 'number' && value >= 0 && Number.isFinite(value);
 }
 
killedBy: Type Guards isPositiveNumber should return false for non-positive numbers
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:104:39
  * Type guard for positive number
  */
 export function isPositiveNumber(value: unknown): value is number {
-  return typeof value === 'number' && value > 0 && Number.isFinite(value);
+  return typeof value === 'number' && true && Number.isFinite(value);
 }
 
killedBy: Type Guards isPositiveNumber should return false for non-positive numbers
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/utils/type-guards.ts:125:81
 /**
  * Assert a condition and narrow the type
  */
-export function assert(condition: unknown, message?: string): asserts condition {
-  if (!condition) {
-    throw new Error(message ?? 'Assertion failed');
-  }
-}
+export function assert(condition: unknown, message?: string): asserts condition {}
 
 /**
killedBy: Type Guards assert should throw for falsy conditions
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/core/utils/type-guards.ts:126:7
  * Assert a condition and narrow the type
  */
 export function assert(condition: unknown, message?: string): asserts condition {
-  if (!condition) {
+  if (condition) {
     throw new Error(message ?? 'Assertion failed');
   }
killedBy: Type Guards assert should not throw for truthy conditions
statusReason: expected [Function] to not throw an error but 'Error: Assertion failed' was thrown

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:126:7
  * Assert a condition and narrow the type
  */
 export function assert(condition: unknown, message?: string): asserts condition {
-  if (!condition) {
+  if (true) {
     throw new Error(message ?? 'Assertion failed');
   }
killedBy: Type Guards assert should not throw for truthy conditions
statusReason: expected [Function] to not throw an error but 'Error: Assertion failed' was thrown

[Killed] LogicalOperator
src/core/utils/type-guards.ts:127:21
  */
 export function assert(condition: unknown, message?: string): asserts condition {
   if (!condition) {
-    throw new Error(message ?? 'Assertion failed');
+    throw new Error(message && 'Assertion failed');
   }
 }
killedBy: Additional coverage for uncovered functions Type guards should test assert function
statusReason: expected [Function] to throw error including 'Assertion failed' but got ''

[Killed] StringLiteral
src/core/utils/type-guards.ts:127:32
  */
 export function assert(condition: unknown, message?: string): asserts condition {
   if (!condition) {
-    throw new Error(message ?? 'Assertion failed');
+    throw new Error(message ?? "");
   }
 }
killedBy: Type Guards assert should throw for falsy conditions
statusReason: expected [Function] to throw error including 'Assertion failed' but got ''

[Killed] EqualityOperator
src/core/utils/type-guards.ts:135:28
  * Check if a value is defined (not null or undefined)
  */
 export function isDefined<T>(value: T | null | undefined): value is T {
-  return value !== null && value !== undefined;
+  return value !== null && value === undefined;
 }
 
killedBy: Type Guards isDefined should return true for defined values
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/utils/type-guards.ts:135:28
  * Check if a value is defined (not null or undefined)
  */
 export function isDefined<T>(value: T | null | undefined): value is T {
-  return value !== null && value !== undefined;
+  return value !== null && true;
 }
 
killedBy: Additional coverage for uncovered functions Type guards should test isDefined
statusReason: expected true to be false // Object.is equality
